Repository: abdukerimovislam/super_mama
Catalog: lib/l10n/app_*.arb
Languages: es, ru

# week1Dev
source: This week is counted from the first day of your last period, even though conception has not yet occurred. Your body is preparing for potential pregnancy.
es: Esta semana se cuenta desde el primer día de tu último período, aunque la concepción aún no ha ocurrido. Tu cuerpo se está preparando para un posible embarazo.
ru: Эта неделя считается с первого дня вашей последней менструации, хотя зачатие еще не произошло. Ваше тело готовится к возможной беременности.

# week1Mom
source: You are on your period. Your body is shedding last month's uterine lining and preparing a new egg for release.
es: Estás en tu período. Tu cuerpo está desprendiendo el revestimiento uterino del mes pasado y preparando un nuevo óvulo para su liberación.
ru: У вас менструация. Ваше тело отторгает слизистую оболочку матки прошлого месяца и готовит новую яйцеклетку к выходу.

# week2Dev
source: Your ovary is preparing to release an egg (ovulation). Fertilization typically occurs at the end of this week or the beginning of the next.
es: Tu ovario se está preparando para liberar un óvulo (ovulación). La fertilización generalmente ocurre al final de esta semana o al principio de la siguiente.
ru: Ваш яичник готовится к высвобождению яйцеклетки (овуляция). Оплодотворение обычно происходит в конце этой недели или в начале следующей.

# week2Mom
source: Your body is preparing for ovulation. Some women may experience mild pelvic discomfort or a heightened sense of smell.
es: Tu cuerpo se está preparando para la ovulación. Algunas mujeres pueden experimentar una leve molestia pélvica o un aumento del sentido del olfato.
ru: Ваше тело готовится к овуляции. Некоторые женщины могут испытывать легкий дискомфорт в области таза или обострение обоняния.

# week3Dev
source: Fertilization has happened! The fertilized egg, now a blastocyst, travels down the fallopian tube and will soon implant in the uterine wall.
es: ¡La fertilización ha ocurrido! El óvulo fertilizado, ahora un blastocisto, viaja por la trompa de Falopio y pronto se implantará en la pared uterina.
ru: Оплодотворение произошло! Оплодотворенная яйцеклетка, теперь бластоциста, движется по фаллопиевой трубе и скоро имплантируется в стенку матки.

# week3Mom
source: You won't feel pregnant yet, but a lot is happening on a cellular level. Some women experience light implantation spotting.
es: Todavía no te sentirás embarazada, pero están sucediendo muchas cosas a nivel celular. Algunas mujeres experimentan un ligero manchado por implantación.
ru: Вы еще не почувствуете себя беременной, но на клеточном уровне происходит многое. Некоторые женщины испытывают легкое имплантационное кровотечение.

# week4Dev
source: The blastocyst has implanted in your uterus. It's now an embryo, about the size of a poppy seed, and the amniotic sac and placenta are beginning to form.
es: El blastocisto se ha implantado en tu útero. Ahora es un embrión, del tamaño de una semilla de amapola, y el saco amniótico y la placenta comienzan a formarse.
ru: Бластоциста имплантировалась в вашу матку. Теперь это эмбрион размером с маковое зернышко, начинают формироваться амниотический мешок и плацента.

# week4Mom
source: This is when you'd expect your period. A missed period is the first major sign. You might feel mild cramping or fatigue.
es: Aquí es cuando esperarías tu período. Un período ausente es la primera señal importante. Podrías sentir calambres leves o fatiga.
ru: В это время вы ожидали бы менструацию. Задержка — первый главный признак. Вы можете чувствовать легкие спазмы или усталость.

# week5Dev
source: The neural tube, which becomes the brain and spinal cord, is forming. The heart is developing and may even start to beat. Baby is the size of an apple seed.
es: El tubo neural, que se convierte en el cerebro y la médula espinal, se está formando. El corazón se está desarrollando e incluso puede comenzar a latir. El bebé es del tamaño de una semilla de manzana.
ru: Формируется нервная трубка, которая станет мозгом и спинным мозгом. Развивается сердце и может даже начать биться. Малыш размером с яблочное семечко.

# week5Mom
source: Morning sickness may begin. Your breasts might feel tender and swollen, and you'll likely feel more tired than usual.
es: Las náuseas matutinas pueden comenzar. Tus senos pueden sentirse sensibles e hinchados, y probablemente te sentirás más cansada de lo habitual.
ru: Может начаться утренняя тошнота. Ваша грудь может стать чувствительной и опухшей, и вы, вероятно, будете чувствовать себя более уставшей, чем обычно.

# week6Dev
source: Facial features like eyes and nostrils are starting to form. Small buds that will become arms and legs are visible. The heart is beating more regularly.
es: Los rasgos faciales como los ojos y las fosas nasales están comenzando a formarse. Pequeños brotes que se convertirán en brazos y piernas son visibles. El corazón late con más regularidad.
ru: Начинают формироваться черты лица, такие как глаза и ноздри. Появляются маленькие почки, которые станут руками и ногами. Сердце бьется более регулярно.

# week6Mom
source: Nausea and food aversions can be strong. Frequent urination is common as your kidneys become more efficient.
es: Las náuseas y las aversiones a los alimentos pueden ser fuertes. La micción frecuente es común a medida que tus riñones se vuelven más eficientes.
ru: Тошнота и отвращение к еде могут быть сильными. Частое мочеиспускание является обычным явлением, так как ваши почки работают более эффективно.

# week7Dev
source: The baby is doubling in size! Hands and feet are emerging from the developing arms and legs. They are about the size of a blueberry.
es: ¡El bebé está duplicando su tamaño! Las manos y los pies están emergiendo de los brazos y piernas en desarrollo. Tienen aproximadamente el tamaño de un arándano.
ru: Малыш удваивается в размере! Появляются кисти и стопы из развивающихся рук и ног. Он размером с голубику.

# week7Mom
source: You might be experiencing mood swings due to hormonal changes. The fatigue and nausea may continue.
es: Podrías estar experimentando cambios de humor debido a los cambios hormonales. La fatiga y las náuseas pueden continuar.
ru: Вы можете испытывать перепады настроения из-за гормональных изменений. Усталость и тошнота могут продолжаться.

# week8Dev
source: Fingers and toes are now forming. The lungs are beginning to take shape. The baby is constantly moving, although you can't feel it yet.
es: Los dedos de las manos y los pies se están formando. Los pulmones comienzan a tomar forma. El bebé se mueve constantemente, aunque todavía no puedes sentirlo.
ru: Формируются пальцы рук и ног. Начинают формироваться легкие. Малыш постоянно двигается, хотя вы этого еще не чувствуете.

# week8Mom
source: Your uterus is expanding, which might cause some light cramping. Your sense of smell can be incredibly sensitive.
es: Tu útero se está expandiendo, lo que podría causar algunos calambres leves. Tu sentido del olfato puede ser increíblemente sensible.
ru: Ваша матка расширяется, что может вызывать легкие спазмы. Ваше обоняние может быть невероятно чувствительным.

# week9Dev
source: All of the baby’s essential organs have begun to form. The tiny tail at the bottom of the spinal cord has disappeared. Baby is the size of a cherry.
es: Todos los órganos esenciales del bebé han comenzado a formarse. La pequeña cola en la parte inferior de la médula espinal ha desaparecido. El bebé es del tamaño de una cereza.
ru: Все основные органы малыша начали формироваться. Крошечный хвостик в нижней части позвоночника исчез. Малыш размером с вишню.

# week9Mom
source: You might feel exhausted. Hormones are surging, and your body is working hard to grow the placenta.
es: Podrías sentirte agotada. Las hormonas están en su apogeo y tu cuerpo está trabajando duro para hacer crecer la placenta.
ru: Вы можете чувствовать себя истощенной. Гормоны зашкаливают, и ваше тело усердно работает над ростом плаценты.

# week10Dev
source: The embryo is now officially a fetus. Fingernails and toenails are starting to form, and the baby can swallow.
es: El embrión ahora es oficialmente un feto. Las uñas de las manos y los pies están comenzando a formarse, y el bebé puede tragar.
ru: Эмбрион теперь официально является плодом. Начинают формироваться ногти на руках и ногах, и малыш может глотать.

# week10Mom
source: Your abdomen may be starting to feel firmer. You might notice your veins are more visible due to increased blood volume.
es: Tu abdomen puede comenzar a sentirse más firme. Podrías notar que tus venas son más visibles debido al aumento del volumen sanguíneo.
ru: Ваш живот может начать казаться более твердым. Вы можете заметить, что вены стали более заметными из-за увеличения объема крови.

# week11Dev
source: The fetus is almost fully formed. They are kicking, stretching, and even hiccuping, but it's still too early for you to feel these movements.
es: El feto está casi completamente formado. Están pateando, estirándose e incluso teniendo hipo, pero todavía es demasiado pronto para que sientas estos movimientos.
ru: Плод почти полностью сформирован. Он пинается, растягивается и даже икает, но вам еще слишком рано чувствовать эти движения.

# week11Mom
source: Nausea may start to subside. Headaches can be common due to hormonal shifts and increased blood volume.
es: Las náuseas pueden comenzar a disminuir. Los dolores de cabeza pueden ser comunes debido a los cambios hormonales y al aumento del volumen sanguíneo.
ru: Тошнота может начать ослабевать. Головные боли могут быть обычным явлением из-за гормональных сдвигов и увеличения объема крови.

# week12Dev
source: Fingerprints are forming on the tiny fingertips. The baby's reflexes are developing; if you poke your belly, they'll likely squirm in response.
es: Se están formando huellas dactilares en las diminutas yemas de los dedos. Los reflejos del bebé se están desarrollando; si tocas tu vientre, probablemente se retorcerá en respuesta.
ru: На кончиках крошечных пальцев формируются отпечатки. Развиваются рефлексы малыша; если вы ткнете в живот, он, скорее всего, извернется в ответ.

# week12Mom
source: The risk of miscarriage drops significantly at the end of this week. Your uterus is starting to rise above the pelvic bone.
es: El riesgo de aborto espontáneo disminuye significativamente al final de esta semana. Tu útero está comenzando a elevarse por encima del hueso pélvico.
ru: Риск выкидыша значительно снижается к концу этой недели. Ваша матка начинает подниматься над лобковой костью.

# week13Dev
source: Vocal cords are developing, and their intestines are moving from the umbilical cord into their abdomen. Baby is about the size of a peach.
es: Las cuerdas vocales se están desarrollando, y sus intestinos se están moviendo desde el cordón umbilical hacia su abdomen. El bebé es del tamaño de un durazno.
ru: Развиваются голосовые связки, и его кишечник перемещается из пуповины в брюшную полость. Малыш размером с персик.

# week13Mom
source: Welcome to the second trimester! You might be feeling more energetic as early pregnancy fatigue subsides. Your belly is likely starting to show.
es: ¡Bienvenida al segundo trimestre! Podrías sentirte con más energía a medida que la fatiga del embarazo temprano disminuye. Es probable que tu vientre comience a notarse.
ru: Добро пожаловать во второй триместр! Вы можете чувствовать себя более энергичной, так как ранняя усталость отступает. Ваш живот, вероятно, начинает проявляться.

# week14Dev
source: Baby can now squint, frown, and make facial expressions. Their kidneys are producing urine, which is released into the amniotic fluid.
es: El bebé ahora puede entrecerrar los ojos, fruncir el ceño y hacer expresiones faciales. Sus riñones están produciendo orina, que se libera en el líquido amniótico.
ru: Малыш теперь может щуриться, хмуриться и делать мимические движения. Его почки вырабатывают мочу, которая выделяется в амниотическую жидкость.

# week14Mom
source: Round ligament pain, a sharp jab in your side, might start as your uterus grows. Your energy levels may be increasing.
es: El dolor del ligamento redondo, una punzada aguda en el costado del abdomen, podría comenzar a medida que tu útero crece. Tus niveles de energía pueden estar aumentando.
ru: Боль в круглой связке, резкий укол в боку, может начаться по мере роста матки. Ваш уровень энергии может увеличиваться.

# week15Dev
source: The baby's skeleton is hardening from soft cartilage to bone. You might be able to find out the baby's sex via ultrasound this week.
es: El esqueleto del bebé se está endureciendo de cartílago blando a hueso. Es posible que puedas averiguar el sexo del bebé mediante una ecografía esta semana.
ru: Скелет ребенка затвердевает, превращаясь из мягкого хряща в кость. Возможно, на этой неделе вы сможете узнать пол ребенка на УЗИ.

# week15Mom
source: You may experience some nasal congestion, known as pregnancy rhinitis, due to hormonal changes.
es: Puedes experimentar algo de congestión nasal, conocida como rinitis del embarazo, debido a los cambios hormonales.
ru: Вы можете испытывать некоторую заложенность носа, известную как ринит беременных, из-за гормональных изменений.

# week16Dev
source: The baby's eyes can now move, and they can hear your voice. Their circulatory and urinary systems are fully functional.
es: Los ojos del bebé ahora pueden moverse y puede oír tu voz. Sus sistemas circulatorio y urinario están en pleno funcionamiento.
ru: Глаза ребенка теперь могут двигаться, и он может слышать ваш голос. Его кровеносная и мочевыделительная системы полностью функционируют.

# week16Mom
source: You might feel the first flutters of movement, called 'quickening.' It can feel like gas bubbles or a gentle tickle.
es: Podrías sentir los primeros aleteos de movimiento. Puede sentirse como burbujas de gas o un cosquilleo suave.
ru: Вы можете почувствовать первые легкие движения, называемые 'шевелениями'. Это может ощущаться как пузырьки газа или нежное щекотание.

# week17Dev
source: Fat stores are beginning to develop under the baby's skin, which will help regulate their body temperature after birth. Baby is the size of an onion.
es: Las reservas de grasa están comenzando a desarrollarse bajo la piel del bebé, lo que ayudará a regular su temperatura corporal después del nacimiento. El bebé es del tamaño de una cebolla.
ru: Под кожей ребенка начинают образовываться жировые запасы, которые помогут регулировать температуру его тела после рождения. Малыш размером с луковицу.

# week17Mom
source: Your appetite may be increasing. Be mindful of making healthy food choices to support your growing baby.
es: Tu apetito puede estar aumentando. Presta atención a elegir alimentos saludables para apoyar a tu bebé en crecimiento.
ru: Ваш аппетит может увеличиться. Следите за выбором здоровой пищи, чтобы поддержать растущего малыша.

# week18Dev
source: The nervous system is maturing rapidly. A protective coating called myelin is forming around the nerves.
es: El sistema nervioso está madurando rápidamente. Se está formando una capa protectora llamada mielina alrededor de los nervios.
ru: Нервная система быстро созревает. Вокруг нервов образуется защитная оболочка, называемая миелином.

# week18Mom
source: You may have trouble sleeping comfortably. Try sleeping on your side with pillows for support. You may also feel dizzy at times.
es: Puedes tener problemas para dormir cómodamente. Intenta dormir de lado con almohadas de apoyo. También puedes sentirte mareada a veces.
ru: Вам может быть трудно спать комфортно. Попробуйте спать на боку с подушками для поддержки. Вы также можете иногда чувствовать головокружение.

# week19Dev
source: A waxy, protective coating called vernix caseosa is forming on the baby's skin to protect it from the amniotic fluid.
es: Se está formando una capa cerosa y protectora llamada vérnix caseosa en la piel del bebé para protegerla del líquido amniótico.
ru: На коже ребенка образуется воскообразное защитное покрытие, называемое первородной смазкой, чтобы защитить ее от амниотической жидкости.

# week19Mom
source: Your skin might be changing. Some women develop dark patches called melasma or a dark line down their abdomen called the linea nigra.
es: Tu piel podría estar cambiando. Algunas mujeres desarrollan manchas oscuras llamadas melasma o una línea oscura en el abdomen llamada línea negra.
ru: Ваша кожа может меняться. У некоторых женщин появляются темные пятна, называемые мелазмой, или темная линия на животе, называемая linea nigra.

# week20Dev
source: Halfway there! You can likely feel your baby's movements more distinctly now. They are swallowing more, which is good practice for their digestive system.
es: ¡A mitad de camino! Es probable que ahora sientas los movimientos de tu bebé de manera más clara. Está tragando más, lo cual es una buena práctica para su sistema digestivo.
ru: Половина пути пройдена! Вероятно, вы теперь более отчетливо чувствуете движения вашего малыша. Он больше глотает, что является хорошей практикой для его пищеварительной системы.

# week20Mom
source: Your anatomy scan ultrasound is usually scheduled around this time. Your belly button might pop out.
es: Tu ecografía morfológica generalmente se programa alrededor de este tiempo. Tu ombligo podría salirse.
ru: Обычно в это время назначается УЗИ для оценки анатомии. Ваш пупок может выпятиться.

# week21Dev
source: The baby's eyebrows and eyelids are now present. Their kicks and jabs are becoming stronger and more frequent.
es: Las cejas y los párpados del bebé ya están presentes. Sus patadas y puñetazos se están volviendo más fuertes y frecuentes.
ru: Брови и веки ребенка теперь присутствуют. Его удары и толчки становятся все сильнее и чаще.

# week21Mom
source: Leg cramps, especially at night, can become common. Make sure you're staying hydrated and stretching.
es: Los calambres en las piernas, especialmente por la noche, pueden volverse comunes. Asegúrate de mantenerte hidratada y de estirar.
ru: Судороги в ногах, особенно ночью, могут стать обычным явлением. Убедитесь, что вы пьете достаточно воды и делаете растяжку.

# week22Dev
source: The baby now looks like a miniature newborn. Their lips, teeth buds, and eyes are more developed. They are about the size of a papaya.
es: El bebé ahora parece un recién nacido en miniatura. Sus labios, brotes dentales y ojos están más desarrollados. Es del tamaño de una papaya.
ru: Ребенок теперь выглядит как миниатюрный новорожденный. Его губы, зачатки зубов и глаза более развиты. Он размером с папайю.

# week22Mom
source: Your feet might swell. Putting your feet up can help. Stretch marks may start to appear on your abdomen, breasts, or thighs.
es: Tus pies podrían hincharse. Poner los pies en alto puede ayudar. Las estrías pueden comenzar a aparecer en tu abdomen, senos o muslos.
ru: Ваши ноги могут отекать. Поднятие ног вверх может помочь. Растяжки могут начать появляться на животе, груди или бедрах.

# week23Dev
source: The sense of hearing is improving. The baby can hear sounds from the outside world, like your voice or music, more clearly.
es: El sentido del oído está mejorando. El bebé puede oír sonidos del mundo exterior, como tu voz o música, con más claridad.
ru: Слух улучшается. Ребенок может слышать звуки из внешнего мира, такие как ваш голос или музыка, более четко.

# week23Mom
source: You might experience Braxton Hicks contractions, which are 'practice' contractions that feel like a tightening of the abdomen.
es: Podrías experimentar contracciones de Braxton Hicks, que son contracciones de 'práctica' que se sienten como un endurecimiento del abdomen.
ru: Вы можете испытывать схватки Брэкстона-Хикса, которые являются 'тренировочными' схватками, ощущаемыми как напряжение живота.

# week24Dev
source: The baby's lungs are developing branches of the respiratory 'tree' as well as cells that produce surfactant, a substance that will help them breathe at birth.
es: Los pulmones del bebé están desarrollando ramas del 'árbol' respiratorio, así como células que producen surfactante, una sustancia que le ayudará a respirar al nacer.
ru: Легкие ребенка развивают ветви дыхательного 'дерева', а также клетки, производящие сурфактант — вещество, которое поможет ему дышать при рождении.

# week24Mom
source: Your doctor will likely test you for gestational diabetes between now and 28 weeks. Your skin may feel itchy as it stretches.
es: Es probable que tu médico te haga una prueba de diabetes gestacional entre ahora y las 28 semanas. Tu piel puede sentirse con picazón a medida que se estira.
ru: Ваш врач, скорее всего, проверит вас на гестационный диабет между этой и 28 неделями. Ваша кожа может чесаться по мере растяжения.

# week25Dev
source: The baby is practicing breathing by inhaling and exhaling amniotic fluid. Their hair is growing and may have color and texture.
es: El bebé está practicando la respiración inhalando y exhalando líquido amniótico. Su cabello está creciendo y puede tener color y textura.
ru: Ребенок практикуется в дыхании, вдыхая и выдыхая амниотическую жидкость. Его волосы растут и могут иметь цвет и текстуру.

# week25Mom
source: Backaches are very common as your center of gravity shifts and your growing belly puts a strain on your back muscles.
es: Los dolores de espalda son muy comunes a medida que tu centro de gravedad cambia y tu creciente vientre ejerce presión sobre los músculos de la espalda.
ru: Боли в спине очень распространены, так как ваш центр тяжести смещается, а растущий живот создает нагрузку на мышцы спины.

# week26Dev
source: The baby's eyes are starting to open and can detect light. Their sleep-wake cycles are becoming more established.
es: Los ojos del bebé están comenzando a abrirse y pueden detectar la luz. Sus ciclos de sueño-vigilia se están estableciendo más.
ru: Глаза ребенка начинают открываться и могут обнаруживать свет. Его циклы сна и бодрствования становятся более устоявшимися.

# week26Mom
source: You might find yourself feeling more forgetful, often called 'pregnancy brain.' It's normal and temporary!
es: Podrías encontrarte más olvidadiza, a menudo llamado 'cerebro de embarazada'. ¡Es normal y temporal!
ru: Вы можете обнаружить, что стали более забывчивой, что часто называют 'беременным мозгом'. Это нормально и временно!

# week27Dev
source: The baby's brain is very active now. Their lungs are still maturing but could function with medical assistance if they were born now.
es: El cerebro del bebé está muy activo ahora. Sus pulmones aún están madurando, pero podrían funcionar con asistencia médica si naciera ahora.
ru: Мозг ребенка сейчас очень активен. Его легкие все еще созревают, но могли бы функционировать с медицинской помощью, если бы он родился сейчас.

# week27Mom
source: Welcome to the third trimester! You might feel more tired again as the baby gets bigger. Heartburn is a common complaint.
es: ¡Bienvenida al tercer trimestre! Podrías sentirte más cansada de nuevo a medida que el bebé crece. La acidez es una queja común.
ru: Добро пожаловать в третий триместр! Вы можете снова почувствовать себя более уставшей по мере роста ребенка. Изжога — частая жалоба.

# week28Dev
source: The baby is gaining weight rapidly, adding layers of fat. They can blink their eyes, which now have eyelashes.
es: El bebé está ganando peso rápidamente, añadiendo capas de grasa. Puede parpadear, y sus ojos ahora tienen pestañas.
ru: Ребенок быстро набирает вес, накапливая слои жира. Он может моргать глазами, на которых теперь есть ресницы.
