Repository: abdukerimovislam/super_mama
Catalog: lib/l10n/app_*.arb
Languages: es, ru

# week28Mom
source: Your doctor's appointments will likely become more frequent. Restless leg syndrome can be an issue for some women at night.
es: Es probable que tus citas con el médico se vuelvan más frecuentes. El síndrome de las piernas inquietas puede ser un problema para algunas mujeres por la noche.
ru: Визиты к врачу, скорее всего, станут чаще. Синдром беспокойных ног может стать проблемой для некоторых женщин ночью.

# week29Dev
source: The baby's bones are fully developed but still soft and pliable. Their kicks are strong and visible from the outside.
es: Los huesos del bebé están completamente desarrollados pero aún son blandos y flexibles. Sus patadas son fuertes y visibles desde el exterior.
ru: Кости ребенка полностью развиты, но все еще мягкие и податливые. Его удары сильные и видны снаружи.

# week29Mom
source: Constipation and hemorrhoids can be a problem due to hormones and pressure from the uterus. Increase your fiber and water intake.
es: El estreñimiento y las hemorroides pueden ser un problema debido a las hormonas y la presión del útero. Aumenta tu ingesta de fibra y agua.
ru: Запоры и геморрой могут стать проблемой из-за гормонов и давления матки. Увеличьте потребление клетчатки и воды.

# week30Dev
source: The baby can now regulate their own body temperature. Their head is growing to make room for the developing brain. Baby is the size of a large cabbage.
es: El bebé ya puede regular su propia temperatura corporal. Su cabeza está creciendo para hacer espacio para el cerebro en desarrollo. El bebé es del tamaño de un repollo grande.
ru: Ребенок теперь может самостоятельно регулировать температуру своего тела. Его голова растет, чтобы освободить место для развивающегося мозга. Малыш размером с большую капусту.

# week30Mom
source: You may feel short of breath as your uterus presses up against your diaphragm. Your sleep may be frequently interrupted.
es: Puedes sentir falta de aire a medida que tu útero presiona contra tu diafragma. Tu sueño puede verse interrumpido con frecuencia.
ru: Вы можете чувствовать одышку, так как матка давит на диафрагму. Ваш сон может часто прерываться.

# week31Dev
source: The baby is practicing all five senses. They are processing information, tracking light, and tasting what you eat through the amniotic fluid.
es: El bebé está practicando los cinco sentidos. Está procesando información, siguiendo la luz y saboreando lo que comes a través del líquido amniótico.
ru: Ребенок практикует все пять чувств. Он обрабатывает информацию, отслеживает свет и пробует на вкус то, что вы едите, через амниотическую жидкость.

# week31Mom
source: You might notice a yellowish fluid, colostrum, leaking from your breasts. This is your baby's first milk.
es: Podrías notar un líquido amarillento, el calostro, que se escapa de tus senos. Esta es la primera leche de tu bebé.
ru: Вы можете заметить желтоватую жидкость, молозиво, вытекающую из вашей груди. Это первое молоко для вашего малыша.

# week32Dev
source: The baby has likely settled into a head-down position in preparation for birth. The toenails have finished growing.
es: Es probable que el bebé se haya acomodado en una posición con la cabeza hacia abajo en preparación para el parto. Las uñas de los pies han terminado de crecer.
ru: Ребенок, вероятно, занял положение головой вниз в подготовке к родам. Ногти на ногах закончили расти.

# week32Mom
source: Braxton Hicks contractions might be getting stronger and more frequent. You're in the home stretch!
es: Las contracciones de Braxton Hicks podrían volverse más fuertes y frecuentes. ¡Estás en la recta final!
ru: Схватки Брэкстона-Хикса могут становиться сильнее и чаще. Вы на финишной прямой!

# week33Dev
source: The baby's skull is still soft, which allows it to move through the birth canal more easily. Their immune system is getting a boost from you.
es: El cráneo del bebé todavía es blando, lo que le permite pasar más fácilmente por el canal de parto. Su sistema inmunológico está recibiendo un impulso de ti.
ru: Череп ребенка все еще мягкий, что позволяет ему легче проходить через родовой канал. Его иммунная система получает от вас поддержку.

# week33Mom
source: It can be hard to find a comfortable position for anything – sitting, standing, or sleeping. The pressure on your bladder is intense.
es: Puede ser difícil encontrar una posición cómoda para cualquier cosa: sentarse, estar de pie o dormir. La presión sobre tu vejiga es intensa.
ru: Может быть трудно найти удобное положение для чего-либо — сидения, стояния или сна. Давление на мочевой пузырь интенсивное.

# week34Dev
source: The baby's central nervous system is maturing, and the lungs are well-developed. The protective vernix coating on their skin is getting thicker.
es: El sistema nervioso central del bebé está madurando y los pulmones están bien desarrollados. La capa protectora de vérnix en su piel se está volviendo más gruesa.
ru: Центральная нервная система ребенка созревает, а легкие хорошо развиты. Защитное покрытие из первородной смазки на его коже становится толще.

# week34Mom
source: Your vision might be a bit blurry due to fluid retention. This should resolve after you give birth.
es: Tu visión podría estar un poco borrosa debido a la retención de líquidos. Esto debería resolverse después de dar a luz.
ru: Ваше зрение может быть немного нечетким из-за задержки жидкости. Это должно пройти после родов.

# week35Dev
source: The baby doesn't have much room to move around anymore, so the movements might feel more like rolling and squirming than sharp kicks.
es: El bebé ya no tiene mucho espacio para moverse, por lo que los movimientos pueden sentirse más como giros y contorsiones que como patadas agudas.
ru: Ребенку уже не так много места для движений, поэтому они могут ощущаться скорее как перекатывания и извивания, чем резкие удары.

# week35Mom
source: You'll likely have a Group B Strep test this week. Your doctor will be checking for signs of labor at your appointments.
es: Es probable que te hagan una prueba de estreptococo del grupo B esta semana. Tu médico buscará signos de trabajo de parto en tus citas.
ru: Вероятно, на этой неделе у вас возьмут анализ на стрептококк группы B. Ваш врач будет следить за признаками начала родов.

# week36Dev
source: The baby is considered 'early term.' They are shedding most of the fine hair (lanugo) and waxy coating (vernix) that covered their skin.
es: El bebé se considera 'a término temprano'. Está perdiendo la mayor parte del vello fino (lanugo) y la capa cerosa (vérnix) que cubría su piel.
ru: Ребенок считается 'ранним доношенным'. Он сбрасывает большую часть тонких волос (лануго) и воскообразного покрытия (первородной смазки), которые покрывали его кожу.

# week36Mom
source: You might feel the baby 'drop' into your pelvis, a process called lightening. This can relieve pressure on your lungs but increase it on your bladder.
es: Podrías sentir que el bebé 'baja' a tu pelvis. Esto puede aliviar la presión sobre tus pulmones pero aumentarla sobre tu vejiga.
ru: Вы можете почувствовать, как ребенок 'опускается' в таз. Это может облегчить давление на легкие, но увеличить его на мочевой пузырь.

# week37Dev
source: The baby is now considered 'full term'! They are practicing breathing movements, and their grasp is firm.
es: ¡El bebé ahora se considera 'a término'! Está practicando movimientos de respiración y su agarre es firme.
ru: Ребенок теперь считается 'доношенным'! Он практикует дыхательные движения, и его хватка крепкая.

# week37Mom
source: You might be feeling a mix of excitement, anxiety, and impatience. Look out for signs of labor like regular contractions or your water breaking.
es: Podrías sentir una mezcla de emoción, ansiedad e impaciencia. Presta atención a los signos de trabajo de parto como contracciones regulares o la ruptura de aguas.
ru: Вы можете чувствовать смесь волнения, беспокойства и нетерпения. Следите за признаками родов, такими как регулярные схватки или отхождение вод.

# week38Dev
source: The baby has a full head of hair, and their brain and lungs will continue to mature until birth. They are gaining about half a pound per week.
es: El bebé tiene una cabellera completa, y su cerebro y pulmones continuarán madurando hasta el nacimiento. Está ganando aproximadamente 200 gramos por semana.
ru: У ребенка полная голова волос, а его мозг и легкие будут продолжать созревать до рождения. Он набирает около 200 граммов в неделю.

# week38Mom
source: You may have a lot of vaginal discharge and lose your mucus plug. Your body is preparing for the big day!
es: Puedes tener mucho flujo vaginal y perder el tapón mucoso. ¡Tu cuerpo se está preparando para el gran día!
ru: У вас может быть много влагалищных выделений и отойти слизистая пробка. Ваше тело готовится к большому дню!

# week39Dev
source: The baby is ready to meet you! Their brain is still developing at an incredible pace. They are plump and ready for life outside the womb.
es: ¡El bebé está listo para conocerte! Su cerebro todavía se está desarrollando a un ritmo increíble. Está regordete y listo para la vida fuera del útero.
ru: Ребенок готов встретиться с вами! Его мозг все еще развивается невероятными темпами. Он пухлый и готов к жизни вне матки.

# week39Mom
source: Try to rest as much as you can. It's a waiting game now! Walking and staying gently active can help encourage labor to start.
es: Intenta descansar todo lo que puedas. ¡Ahora es un juego de espera! Caminar y mantenerse suavemente activa puede ayudar a que comience el trabajo de parto.
ru: Старайтесь отдыхать как можно больше. Теперь это игра в ожидание! Прогулки и легкая активность могут помочь стимулировать начало родов.

# week40Dev
source: Happy due date! Remember that only about 5% of babies are born on their due date. Your baby is fully mature and waiting for the signal to be born.
es: ¡Feliz fecha probable de parto! Recuerda que solo alrededor del 5% de los bebés nacen en su fecha. Tu bebé está completamente maduro y esperando la señal para nacer.
ru: С предполагаемой датой родов! Помните, что только около 5% детей рождаются в свой срок. Ваш малыш полностью созрел и ждет сигнала к рождению.

# week40Mom
source: You might feel a lot of pelvic pressure and discomfort. Call your doctor if you think you are in labor or if your water breaks.
es: Podrías sentir mucha presión pélvica e incomodidad. Llama a tu médico si crees que estás de parto o si se rompen las aguas.
ru: Вы можете чувствовать большое давление в области таза и дискомфорт. Позвоните врачу, если думаете, что у вас начались роды, или если отошли воды.

# week41Dev
source: The baby is now 'late term.' They continue to grow, and their nails and hair may be quite long at birth.
es: El bebé ahora está 'a término tardío'. Continúa creciendo, y sus uñas y cabello pueden ser bastante largos al nacer.
ru: Ребенок теперь 'поздний доношенный'. Он продолжает расти, и его ногти и волосы могут быть довольно длинными при рождении.

# week41Mom
source: Your doctor may discuss options for inducing labor. You will be monitored closely to ensure the baby is still doing well.
es: Tu médico puede discutir opciones para inducir el parto. Serás monitoreada de cerca para asegurar que el bebé todavía esté bien.
ru: Ваш врач может обсудить варианты стимуляции родов. Вас будут тщательно наблюдать, чтобы убедиться, что с ребенком все в порядке.

# week42Dev
source: The baby is 'post-term.' The risks are slightly higher, so induction is very likely if you haven't gone into labor naturally.
es: El bebé está 'postérmino'. Los riesgos son ligeramente más altos, por lo que la inducción es muy probable si no has entrado en trabajo de parto de forma natural.
ru: Ребенок 'переношенный'. Риски немного выше, поэтому стимуляция очень вероятна, если роды не начались естественным образом.

# week42Mom
source: It can be emotionally draining to go past your due date. Trust your body and your medical team. You will meet your baby very soon!
es: Puede ser emocionalmente agotador pasar de la fecha de parto. Confía en tu cuerpo y en tu equipo médico. ¡Conocerás a tu bebé muy pronto!
ru: Может быть эмоционально тяжело перехаживать срок. Доверяйте своему телу и своей медицинской команде. Вы очень скоро встретитесь со своим малышом!

# settingsUserFallbackName
source: Bloom Mama User
es: Usuaria de Bloom Mama
ru: Пользователь Bloom Mama

# settingsUserFallbackEmail
source: No email associated
es: Sin correo asociado
ru: Нет связанной почты

# settingsAffirmationsEnabled
source: Daily affirmations enabled!
es: ¡Afirmaciones diarias activadas!
ru: Ежедневные аффирмации включены!

# settingsAffirmationsDisabled
source: Daily affirmations disabled.
es: Afirmaciones diarias desactivadas.
ru: Ежедневные аффирмации выключены.

# symptomHistoryErrorLoad
source: Failed to load history.
es: Error al cargar el historial.
ru: Не удалось загрузить историю.

# symptonHistoryErrorEmpty
source: No symptom history found.
es: No se encontró historial de síntomas.
ru: История симптомов не найдена.

# symptomHistoryTooltip
source: View History
es: Ver historial
ru: Просмотр истории

# symptomErrorLoad
source: Could not load today's symptoms.
es: No se pudieron cargar los síntomas de hoy.
ru: Не удалось загрузить сегодняшние симптомы.

# symptomSuccessSave
source: Symptoms for today saved!
es: ¡Síntomas de hoy guardados!
ru: Симптомы за сегодня сохранены!

# symptomErrorSave
source: Failed to save symptoms: {error}
es: Error al guardar los síntomas: {error}
ru: Не удалось сохранить симптомы: {error}

# symptomDialogWhatToDo
source: What you can do:
es: Lo que puedes hacer:
ru: Что можно сделать:

# symptomDialogCheckbox
source: I'm experiencing this
es: Estoy sintiendo esto
ru: Я испытываю это

# symptomDialogClose
source: Close
es: Cerrar
ru: Закрыть

# symptomNauseaDef
source: A feeling of sickness, often called 'morning sickness' but can occur anytime.
es: Una sensación de malestar estomacal, a menudo llamada 'náuseas matutinas', pero puede ocurrir en cualquier momento.
ru: Чувство тошноты с позывом к рвоте, часто называемое 'утренней тошнотой', но может возникать в любое время.

# symptomNauseaAdv
source: Try eating small, frequent meals. Ginger tea or candies can help. Stay hydrated.
es: Intenta comer comidas pequeñas y frecuentes. El té de jengibre o los caramelos pueden ayudar. Mantente hidratada.
ru: Попробуйте есть маленькими, частыми порциями. Имбирный чай или леденцы могут помочь. Пейте достаточно воды.

# symptomFatigueDef
source: An overwhelming feeling of tiredness and lack of energy.
es: Una abrumadora sensación de cansancio y falta de energía.
ru: Подавляющее чувство усталости и нехватки энергии.

# symptomFatigueAdv
source: Listen to your body and rest when you can. Gentle exercise like walking can boost energy.
es: Escucha a tu cuerpo y descansa cuando puedas. El ejercicio suave como caminar puede aumentar la energía.
ru: Прислушивайтесь к своему телу и отдыхайте, когда можете. Легкие упражнения, такие как ходьба, могут повысить энергию.

# symptomHeadacheDef
source: Pain or discomfort in the head, often caused by hormonal shifts or dehydration.
es: Dolor o molestia en la cabeza, a menudo causado por cambios hormonales o deshidratación.
ru: Боль или дискомфорт в голове, часто вызванные гормональными сдвигами или обезвоживанием.

# symptomHeadacheAdv
source: Rest in a quiet, dark room. Apply a cool compress. Consult your doctor before taking any medication.
es: Descansa en una habitación tranquila y oscura. Aplica una compresa fría. Consulta a tu médico antes de tomar cualquier medicamento.
ru: Отдыхайте в тихой, темной комнате. Приложите прохладный компресс. Проконсультируйтесь с врачом перед приемом любых лекарств.

# symptomHeartburnDef
source: A burning sensation in the chest, caused by stomach acid flowing back up.
es: Una sensación de ardor en el pecho, causada por el reflujo del ácido del estómago.
ru: Ощущение жжения в груди, вызванное забросом желудочной кислоты в пищевод.

# symptomHeartburnAdv
source: Eat smaller meals. Avoid spicy, greasy, or acidic foods. Don't lie down immediately after eating.
es: Come porciones más pequeñas. Evita alimentos picantes, grasosos o ácidos. No te acuestes inmediatamente después de comer.
ru: Ешьте меньшими порциями. Избегайте острой, жирной или кислой пищи. Не ложитесь сразу после еды.

# symptomConstipationDef
source: Difficulty passing stools, caused by hormonal changes slowing down digestion.
es: Dificultad para evacuar, causada por cambios hormonales que ralentizan la digestión.
ru: Трудности с опорожнением кишечника, вызванные замедлением пищеварения из-за гормонов.

# symptomConstipationAdv
source: Increase your fiber intake with fruits, vegetables, and whole grains. Drink plenty of water and stay active.
es: Aumenta tu ingesta de fibra con frutas, verduras y granos integrales. Bebe mucha agua y mantente activa.
ru: Увеличьте потребление клетчатки: ешьте больше фруктов, овощей и цельнозерновых. Пейте много воды и будьте активны.

# symptomBackPainDef
source: Aches and pains in the lower back due to weight gain and a shifting center of gravity.
es: Dolores en la parte baja de la espalda debido al aumento de peso y al cambio del centro de gravedad.
ru: Боли в нижней части спины из-за увеличения веса и смещения центра тяжести.

# symptomBackPainAdv
source: Practice good posture. Use a supportive chair. A warm bath or prenatal massage may provide relief.
es: Practica una buena postura. Usa una silla con soporte. Un baño tibio o un masaje prenatal pueden aliviar.
ru: Следите за осанкой. Используйте поддерживающий стул. Теплая ванна или пренатальный массаж могут принести облегчение.

# symptomSwellingDef
source: Mild swelling (edema) in the ankles, feet, and hands, caused by fluid retention.
es: Hinchazón leve (edema) en tobillos, pies y manos, causada por la retención de líquidos.
ru: Небольшие отеки (эдема) на лодыжках, ступнях и руках, вызванные задержкой жидкости.

# symptomSwellingAdv
source: Elevate your feet whenever possible. Avoid standing for long periods. Wear comfortable shoes.
es: Eleva los pies siempre que sea posible. Evita estar de pie por largos períodos. Usa zapatos cómodos.
ru: Поднимайте ноги как можно чаще. Избегайте длительного стояния. Носите удобную обувь.

# symptomCrampsDef
source: Mild, period-like cramping in the lower abdomen, often due to the uterus expanding.
es: Calambres leves, similares a los menstruales, en el abdomen bajo, a menudo debido a la expansión del útero.
ru: Легкие, похожие на менструальные, спазмы внизу живота, часто из-за расширения матки.

# symptomCrampsAdv
source: Change positions, rest, or take a warm bath. If cramping is severe, contact your doctor immediately.
es: Cambia de posición, descansa o toma un baño tibio. Si los calambres son severos, contacta a tu médico inmediatamente.
ru: Смените положение, отдохните или примите теплую ванну. Если спазмы сильные, немедленно свяжитесь с врачом.

# symptomSkinChangesDef
source: Changes like acne, dark patches (melasma), or the 'linea nigra' on your belly.
es: Cambios como acné, manchas oscuras (melasma) o la 'línea negra' en tu vientre.
ru: Изменения, такие как акне, темные пятна (мелазма) или 'черная линия' на животе.

# symptomSkinChangesAdv
source: Use gentle, oil-free skincare products. Always wear sunscreen, as your skin is more sensitive. Most changes fade after pregnancy.
es: Usa productos para la piel suaves y sin aceite. Usa siempre protector solar, ya que tu piel es más sensible.
ru: Используйте мягкие средства для ухода за кожей. Всегда используйте солнцезащитный крем, так как ваша кожа более чувствительна.

# symptomCravingsDef
source: A strong, sudden desire to eat a particular type of food.
es: Un deseo fuerte y repentino de comer un tipo particular de comida.
ru: Сильное, внезапное желание съесть определенный вид пищи.

# symptomCravingsAdv
source: It's okay to indulge in moderation, but try to find healthier alternatives if possible.
es: Está bien darse un gusto con moderación, pero intenta encontrar alternativas más saludables si es posible.
ru: Можно позволять себе небольшие слабости в умеренных количествах, но старайтесь находить более здоровые альтернативы.

# symptomMoodSwingsDef
source: Rapidly changing emotions, from happy to sad or irritable, due to hormonal fluctuations.
es: Emociones que cambian rápidamente, de feliz a triste o irritable, debido a las fluctuaciones hormonales.
ru: Быстро меняющиеся эмоции, от радости до грусти или раздражительности, из-за гормональных колебаний.

# symptomMoodSwingsAdv
source: Get plenty of rest, eat well, and exercise. Talk about your feelings with your partner or a friend. It's okay to not be okay!
es: Descansa lo suficiente, come bien y haz ejercicio. Habla sobre tus sentimientos con tu pareja o un amigo.
ru: Высыпайтесь, хорошо питайтесь и занимайтесь спортом. Говорите о своих чувствах с партнером или другом.

# symptomAnxietyDef
source: Feelings of worry, nervousness, or unease about the pregnancy, birth, or parenthood.
es: Sentimientos de preocupación, nerviosismo o inquietud sobre el embarazo, el parto o la maternidad.
ru: Чувства беспокойства, нервозности или тревоги по поводу беременности, родов или родительства.

# symptomAnxietyAdv
source: Practice mindfulness or prenatal meditation. Join a support group. Discuss your fears with your healthcare provider.
es: Practica la atención plena o la meditación prenatal. Únete a un grupo de apoyo. Discute tus miedos con tu proveedor de atención médica.
ru: Практикуйте осознанность или пренатальную медитацию. Присоединитесь к группе поддержки. Обсудите свои страхи с врачом.

# symptomNausea
source: Nausea
es: Náuseas
ru: Тошнота

# symptomFatigue
source: Fatigue
es: Fatiga
ru: Усталость

# symptomHeadache
source: Headache
es: Dolor de cabeza
ru: Головная боль

# symptomHeartburn
source: Heartburn
es: Acidez
ru: Изжога

# symptomConstipation
source: Constipation
es: Estreñimiento
ru: Запор

# symptomBackPain
source: Back Pain
es: Dolor de espalda
ru: Боль в спине

# symptomSwelling
source: Swelling
es: Hinchazón
ru: Отеки

# symptomCramps
source: Cramps
es: Calambres
ru: Спазмы

# symptomSkinChanges
source: Skin Changes
es: Cambios en la piel
ru: Изменения кожи

# symptomCravings
source: Cravings
es: Antojos
ru: Тяга к еде

# symptomMoodSwings
source: Mood Swings
es: Cambios de humor
ru: Перепады настроения

# symptomAnxiety
source: Anxiety
es: Ansiedad
ru: Тревожность

# uncommonSymptomDetailTitle
source: Symptom Details
es: Detalles del síntoma
ru: Детали симптома

# uncommonSymptomIsItNormal
source: Is It Normal?
es: ¿Es normal?
ru: Это нормально?

# uncommonSymptom1Title
source: Metallic Taste in Mouth?
es: ¿Sabor metálico en la boca?
ru: Металлический привкус во рту?

# uncommonSymptom1Desc
source: Some women report a sour or metallic taste in their mouth during the first trimester, even when not eating. This is known as dysgeusia.
es: Algunas mujeres reportan un sabor agrio o metálico en la boca durante el primer trimestre, incluso sin estar comiendo. Esto se conoce como disgeusia.
ru: Некоторые женщины сообщают о кислом или металлическом привкусе во рту в первом триместре, даже когда не едят. Это известно как дисгевзия.
