// ignore: unused_import
import 'package:intl/intl.dart' as intl;
import 'app_localizations.dart';

// ignore_for_file: type=lint

/// The translations for Russian (`ru`).
class AppLocalizationsRu extends AppLocalizations {
  AppLocalizationsRu([String locale = 'ru']) : super(locale);

  @override
  String get appName => 'Bloom Mama';

  @override
  String get signInWelcome => 'Добро пожаловать в Bloom Mama';

  @override
  String get signInWithGoogle => 'Войти через Google';

  @override
  String get navHome => 'Главная';

  @override
  String get navJournal => 'Дневник';

  @override
  String get navSymptoms => 'Симптомы';

  @override
  String get navNormal => 'Это норма?';

  @override
  String get navChecklist => 'Список';

  @override
  String get navTimers => 'Таймеры';

  @override
  String get homeScreenWeek => 'Неделя';

  @override
  String get homeScreenBabySizeOf => 'Ваш малыш размером с';

  @override
  String get homeScreenSetLMP => 'Установить дату последней менструации';

  @override
  String homeScreenGoToMyWeek(int weekNumber) {
    return 'К моей текущей неделе (Неделя $weekNumber)';
  }

  @override
  String get homeScreenChangeDate => 'Изменить дату';

  @override
  String get dailyDigestTitle => '✨ Ежедневная подборка';

  @override
  String get dailyDigestTip => 'Совет';

  @override
  String get dailyDigestAffirmation => 'Аффирмация';

  @override
  String get settingsTitle => 'Настройки';

  @override
  String get settingsDailyAffirmations => 'Ежедневные аффирмации';

  @override
  String get settingsDailyAffirmationsSubtitle =>
      'Получайте позитивное сообщение дважды в день.';

  @override
  String get settingsLogOut => 'Выйти';

  @override
  String get settingsLogOutConfirmTitle => 'Подтвердите выход';

  @override
  String get settingsLogOutConfirm => 'Вы уверены, что хотите выйти?';

  @override
  String get settingsCancel => 'Отмена';

  @override
  String get symptomTrackerTitle => 'Трекер симптомов';

  @override
  String get symptomTrackerGreeting => 'Как вы себя чувствуете сегодня?';

  @override
  String get symptomTrackerSave => 'Сохранить симптомы за сегодня';

  @override
  String get symptomHistoryTitle => 'История симптомов';

  @override
  String get symptomCatCommon => 'Частые недомогания';

  @override
  String get symptomCatBody => 'Изменения в теле';

  @override
  String get symptomCatMood => 'Настроение и желания';

  @override
  String get isItNormalTitle => 'Это нормально?';

  @override
  String get checklistTitle => 'Сумка в роддом';

  @override
  String get checklistItemID => 'Паспорт и страховой полис';

  @override
  String get checklistItemBirthPlan => 'План родов (если есть)';

  @override
  String get checklistItemPhone =>
      'Телефон и зарядное устройство (с длинным проводом!)';

  @override
  String get checklistItemRobe => 'Удобный халат или ночная рубашка';

  @override
  String get checklistItemSlippers => 'Тапочки и нескользящие носки';

  @override
  String get checklistItemNursingBra => 'Бюстгальтер для кормления и прокладки';

  @override
  String get checklistItemOutfitMom => 'Одежда на выписку для мамы';

  @override
  String get checklistItemToiletries =>
      'Бальзам для губ и туалетные принадлежности';

  @override
  String get checklistItemSnacks => 'Перекусы и напитки';

  @override
  String get checklistItemOutfitBaby => 'Одежда на выписку для малыша';

  @override
  String get checklistItemCarSeat => 'Установленное автокресло';

  @override
  String get checklistItemPillow => 'Подушка из дома';

  @override
  String get timersHubTitle => 'Таймеры';

  @override
  String get timersContractionTitle => 'Таймер схваток';

  @override
  String get timersContractionSubtitle =>
      'Засекайте схватки и отслеживайте их частоту.';

  @override
  String get timersKickTitle => 'Счетчик толчков';

  @override
  String get timersKickSubtitle =>
      'Отслеживайте толчки вашего малыша, чтобы убедиться в его активности.';

  @override
  String get journalTitle => 'Ежедневный дневник';

  @override
  String get journalGreeting => 'Как вы себя чувствуете сегодня?';

  @override
  String get journalTodaysThoughts => 'Мысли за сегодня:';

  @override
  String get journalHintText =>
      'Напишите о своем дне, чувствах или особенных моментах...';

  @override
  String get journalSave => 'Сохранить запись';

  @override
  String get journalHistoryTitle => 'История записей';

  @override
  String get notificationMorningTitle => '☀️ Доброе утро, Мама!';

  @override
  String get notificationEveningTitle => '🌙 Добрый вечер, Мама!';

  @override
  String get tip1 =>
      'Пейте достаточно воды! Старайтесь выпивать 8-10 стаканов в день, чтобы поддержать свой организм и растущего малыша.';

  @override
  String get tip2 =>
      'Даже 15-минутная прогулка может поднять настроение и энергию. Прислушивайтесь к своему телу и не переусердствуйте.';

  @override
  String get tip3 =>
      'Фолиевая кислота крайне важна для развития нервной трубки малыша. Убедитесь, что ваши пренатальные витамины содержат не менее 400 мкг.';

  @override
  String get tip4 =>
      'Утренняя тошнота может начаться в любое время. Попробуйте держать у кровати простые крекеры, чтобы съесть их перед тем, как встать.';

  @override
  String get tip5 =>
      'Ваше тело усердно работает. Не чувствуйте вины за то, что вздремнули, если чувствуете усталость.';

  @override
  String get tip6 =>
      'Добавьте больше клетчатки в свой рацион: фрукты, овощи и цельнозерновые продукты помогут предотвратить запор.';

  @override
  String get tip7 =>
      'Разговаривайте со своим малышом! В этом триместре он начинает слышать ваш голос, и это отличный способ установить связь.';

  @override
  String get tip8 =>
      'Начните вести простой дневник беременности. Записывайте свои мысли, чувства и важные моменты.';

  @override
  String get tip9 =>
      'Ваша кожа сейчас более чувствительна к солнцу. Не забывайте использовать солнцезащитный крем даже в пасмурные дни.';

  @override
  String get tip10 =>
      'Получаете ли вы достаточно кальция? Молочные продукты, листовая зелень и обогащенные продукты помогают строить кости малыша.';

  @override
  String get tip11 =>
      'Ежедневно выполняйте упражнения Кегеля для укрепления мышц тазового дна для родов и послеродового восстановления.';

  @override
  String get tip12 =>
      'Мучает изжога? Попробуйте есть меньшими порциями, но чаще в течение дня.';

  @override
  String get tip13 =>
      'Теплая (не горячая!) ванна — прекрасный способ успокоить больные мышцы и расслабиться.';

  @override
  String get tip14 =>
      'Начните увлажнять живот, бедра и грудь, чтобы помочь коже растягиваться и уменьшить зуд.';

  @override
  String get tip15 =>
      'Перепады настроения? Это гормоны. Будьте добры к себе и делитесь своими чувствами с партнером.';

  @override
  String get tip16 =>
      'Составьте список вопросов, чтобы задать их врачу на следующем приеме и ничего не забыть.';

  @override
  String get tip17 =>
      'Практикуйте упражнения на глубокое дыхание. Это мощный инструмент для управления стрессом сейчас и болью во время родов.';

  @override
  String get tip18 =>
      'Поднимайте ноги в конце дня, чтобы уменьшить отечность лодыжек.';

  @override
  String get tip19 =>
      'Носите удобную, поддерживающую обувь. Ваш центр тяжести смещается!';

  @override
  String get tip20 =>
      'Тяга к определенной еде нормальна! Позволяйте себе небольшие слабости, но в целом придерживайтесь сбалансированной диеты.';

  @override
  String get tip21 =>
      'Носите с собой здоровый перекус, например, орехи или гранолу, чтобы не допускать сильного голода.';

  @override
  String get tip22 =>
      'Начните утро с легкой растяжки, чтобы снять скованность и улучшить кровообращение.';

  @override
  String get tip23 =>
      'Чувствуете тревогу? Это нормально. Поделитесь своими переживаниями с кем-то, кому доверяете.';

  @override
  String get tip24 =>
      'Изучите свою медицинскую страховку, чтобы понимать покрытие по беременности и родам и варианты госпиталей.';

  @override
  String get tip25 =>
      'Делайте еженедельное фото животика, чтобы отслеживать свой прекрасный прогресс!';

  @override
  String get tip26 =>
      'Спите на левом боку, чтобы улучшить приток крови к плаценте и вашему ребенку.';

  @override
  String get tip27 =>
      'Читайте по одной главе книги о беременности или родительстве каждый день, чтобы чувствовать себя более подготовленной.';

  @override
  String get tip28 =>
      'Если не можете уснуть, не лежите просто так. Встаньте, почитайте книгу или послушайте успокаивающую музыку.';

  @override
  String get tip29 =>
      'Вовлекайте партнера в процесс. Пусть он разговаривает с животиком или чувствует толчки.';

  @override
  String get tip30 =>
      'По мере приближения срока родов, соберите сумку в роддом. Лучше быть готовой заранее!';

  @override
  String get affirmation1 => 'Я создаю чудо внутри себя.';

  @override
  String get affirmation2 => 'Мое тело сильное и способное.';

  @override
  String get affirmation3 =>
      'Я доверяю мудрости своего тела в выращивании моего ребенка.';

  @override
  String get affirmation4 =>
      'Я спокойна, расслаблена и нахожусь в мире с собой.';

  @override
  String get affirmation5 =>
      'Каждый день приближает меня к встрече с моим малышом.';

  @override
  String get affirmation6 => 'Я с любовью принимаю изменения в своем теле.';

  @override
  String get affirmation7 => 'Я замечательная мать.';

  @override
  String get affirmation8 =>
      'Я создаю безопасный и любящий дом для моего ребенка.';

  @override
  String get affirmation9 => 'Я благодарна за это невероятное путешествие.';

  @override
  String get affirmation10 => 'Я сильная, уверенная и полная сил.';

  @override
  String get affirmation11 => 'Я отпускаю весь страх и приветствую любовь.';

  @override
  String get affirmation12 => 'Мой ребенок чувствует мой покой и радость.';

  @override
  String get affirmation13 =>
      'Я питаю себя и своего ребенка каждым своим выбором.';

  @override
  String get affirmation14 => 'Я прекрасна в своей беременности.';

  @override
  String get affirmation15 => 'Я готова к позитивному опыту родов.';

  @override
  String get affirmation16 =>
      'Я терпелива и доверяю времени своего путешествия.';

  @override
  String get affirmation17 => 'Мое тело точно знает, что делать.';

  @override
  String get affirmation18 => 'Я окружена любовью и поддержкой.';

  @override
  String get affirmation19 => 'Я отлично справляюсь, и этого достаточно.';

  @override
  String get affirmation20 => 'Моя сила больше любого дискомфорта.';

  @override
  String get affirmation21 =>
      'Сегодня я выбираю сосредоточиться на радости и благодарности.';

  @override
  String get affirmation22 => 'Я глубоко связана со своим ребенком.';

  @override
  String get affirmation23 =>
      'Каждый толчок и шевеление — это напоминание о жизни, которую я создаю.';

  @override
  String get affirmation24 => 'Я — источник любви и жизни.';

  @override
  String get affirmation25 =>
      'Я нахожусь именно там, где мне нужно быть прямо сейчас.';

  @override
  String get affirmation26 => 'Я достойна прекрасной и здоровой беременности.';

  @override
  String get affirmation27 => 'Я уверена в своей способности родить.';

  @override
  String get affirmation28 => 'Мой ребенок и я здоровы и в безопасности.';

  @override
  String get affirmation29 => 'Я создаю жизнь, и это шедевр.';

  @override
  String get affirmation30 =>
      'Сегодня я буду чтить свое тело, свой разум и своего ребенка.';

  @override
  String get kickCounterTitle => 'Счетчик толчков';

  @override
  String get kickCounterInstructions =>
      'Нажимайте кнопку ниже каждый раз, когда чувствуете толчок.';

  @override
  String get kickCounterRecordKick => 'Записать толчок';

  @override
  String kickCounterTime(String time) {
    return 'Время: $time';
  }

  @override
  String kickCounterKicks(int count) {
    String _temp0 = intl.Intl.pluralLogic(
      count,
      locale: localeName,
      other: 'толчка',
      many: 'толчков',
      few: 'толчка',
      one: 'толчок',
    );
    return '$_temp0';
  }

  @override
  String get kickCounterGoalReached => 'Цель достигнута!';

  @override
  String kickCounterGoalMessage(String time) {
    return 'Вы насчитали 10 толчков за $time.';
  }

  @override
  String get ok => 'OK';

  @override
  String get notificationChannelName => 'Ежедневные аффирмации';

  @override
  String get notificationChannelDescription =>
      'Предоставляет ежедневные позитивные аффирмации для мам.';

  @override
  String get journalMoodHappy => 'Счастлива';

  @override
  String get journalMoodGrateful => 'Благодарна';

  @override
  String get journalMoodTired => 'Устала';

  @override
  String get journalMoodAnxious => 'Тревожно';

  @override
  String get journalMoodSad => 'Грустно';

  @override
  String get journalErrorEmpty =>
      'Пожалуйста, напишите что-нибудь или выберите настроение.';

  @override
  String get journalSuccessSave => 'Запись в дневнике сохранена!';

  @override
  String journalErrorSave(String error) {
    return 'Не удалось сохранить запись: $error';
  }

  @override
  String get journalHistoryErrorLogin =>
      'Вы должны войти в систему, чтобы просмотреть историю.';

  @override
  String get journalHistoryErrorEmpty => 'Записей в дневнике пока нет.';

  @override
  String journalHistoryMood(String moodName) {
    return 'Настроение: $moodName';
  }

  @override
  String get contractionTimerTitle => 'Таймер схваток';

  @override
  String get contractionTimerResetTooltip => 'Сбросить';

  @override
  String get contractionTimerStart => 'Начать схватку';

  @override
  String get contractionTimerStop => 'Закончить схватку';

  @override
  String get contractionTimerEmptyState =>
      'Начните замерять вашу первую схватку.';

  @override
  String contractionTimerDuration(String duration) {
    return 'Длительность: $duration';
  }

  @override
  String contractionTimerFrequency(String frequency) {
    return 'Частота: $frequency';
  }

  @override
  String signInError(String error) {
    return 'Ошибка входа: $error';
  }

  @override
  String get week1Dev =>
      'Эта неделя считается с первого дня вашей последней менструации, хотя зачатие еще не произошло. Ваше тело готовится к возможной беременности.';

  @override
  String get week1Mom =>
      'У вас менструация. Ваше тело отторгает слизистую оболочку матки прошлого месяца и готовит новую яйцеклетку к выходу.';

  @override
  String get week2Dev =>
      'Ваш яичник готовится к высвобождению яйцеклетки (овуляция). Оплодотворение обычно происходит в конце этой недели или в начале следующей.';

  @override
  String get week2Mom =>
      'Ваше тело готовится к овуляции. Некоторые женщины могут испытывать легкий дискомфорт в области таза или обострение обоняния.';

  @override
  String get week3Dev =>
      'Оплодотворение произошло! Оплодотворенная яйцеклетка, теперь бластоциста, движется по фаллопиевой трубе и скоро имплантируется в стенку матки.';

  @override
  String get week3Mom =>
      'Вы еще не почувствуете себя беременной, но на клеточном уровне происходит многое. Некоторые женщины испытывают легкое имплантационное кровотечение.';

  @override
  String get week4Dev =>
      'Бластоциста имплантировалась в вашу матку. Теперь это эмбрион размером с маковое зернышко, начинают формироваться амниотический мешок и плацента.';

  @override
  String get week4Mom =>
      'В это время вы ожидали бы менструацию. Задержка — первый главный признак. Вы можете чувствовать легкие спазмы или усталость.';

  @override
  String get week5Dev =>
      'Формируется нервная трубка, которая станет мозгом и спинным мозгом. Развивается сердце и может даже начать биться. Малыш размером с яблочное семечко.';

  @override
  String get week5Mom =>
      'Может начаться утренняя тошнота. Ваша грудь может стать чувствительной и опухшей, и вы, вероятно, будете чувствовать себя более уставшей, чем обычно.';

  @override
  String get week6Dev =>
      'Начинают формироваться черты лица, такие как глаза и ноздри. Появляются маленькие почки, которые станут руками и ногами. Сердце бьется более регулярно.';

  @override
  String get week6Mom =>
      'Тошнота и отвращение к еде могут быть сильными. Частое мочеиспускание является обычным явлением, так как ваши почки работают более эффективно.';

  @override
  String get week7Dev =>
      'Малыш удваивается в размере! Появляются кисти и стопы из развивающихся рук и ног. Он размером с голубику.';

  @override
  String get week7Mom =>
      'Вы можете испытывать перепады настроения из-за гормональных изменений. Усталость и тошнота могут продолжаться.';

  @override
  String get week8Dev =>
      'Формируются пальцы рук и ног. Начинают формироваться легкие. Малыш постоянно двигается, хотя вы этого еще не чувствуете.';

  @override
  String get week8Mom =>
      'Ваша матка расширяется, что может вызывать легкие спазмы. Ваше обоняние может быть невероятно чувствительным.';

  @override
  String get week9Dev =>
      'Все основные органы малыша начали формироваться. Крошечный хвостик в нижней части позвоночника исчез. Малыш размером с вишню.';

  @override
  String get week9Mom =>
      'Вы можете чувствовать себя истощенной. Гормоны зашкаливают, и ваше тело усердно работает над ростом плаценты.';

  @override
  String get week10Dev =>
      'Эмбрион теперь официально является плодом. Начинают формироваться ногти на руках и ногах, и малыш может глотать.';

  @override
  String get week10Mom =>
      'Ваш живот может начать казаться более твердым. Вы можете заметить, что вены стали более заметными из-за увеличения объема крови.';

  @override
  String get week11Dev =>
      'Плод почти полностью сформирован. Он пинается, растягивается и даже икает, но вам еще слишком рано чувствовать эти движения.';

  @override
  String get week11Mom =>
      'Тошнота может начать ослабевать. Головные боли могут быть обычным явлением из-за гормональных сдвигов и увеличения объема крови.';

  @override
  String get week12Dev =>
      'На кончиках крошечных пальцев формируются отпечатки. Развиваются рефлексы малыша; если вы ткнете в живот, он, скорее всего, извернется в ответ.';

  @override
  String get week12Mom =>
      'Риск выкидыша значительно снижается к концу этой недели. Ваша матка начинает подниматься над лобковой костью.';

  @override
  String get week13Dev =>
      'Развиваются голосовые связки, и его кишечник перемещается из пуповины в брюшную полость. Малыш размером с персик.';

  @override
  String get week13Mom =>
      'Добро пожаловать во второй триместр! Вы можете чувствовать себя более энергичной, так как ранняя усталость отступает. Ваш живот, вероятно, начинает проявляться.';

  @override
  String get week14Dev =>
      'Малыш теперь может щуриться, хмуриться и делать мимические движения. Его почки вырабатывают мочу, которая выделяется в амниотическую жидкость.';

  @override
  String get week14Mom =>
      'Боль в круглой связке, резкий укол в боку, может начаться по мере роста матки. Ваш уровень энергии может увеличиваться.';

  @override
  String get week15Dev =>
      'Скелет ребенка затвердевает, превращаясь из мягкого хряща в кость. Возможно, на этой неделе вы сможете узнать пол ребенка на УЗИ.';

  @override
  String get week15Mom =>
      'Вы можете испытывать некоторую заложенность носа, известную как ринит беременных, из-за гормональных изменений.';

  @override
  String get week16Dev =>
      'Глаза ребенка теперь могут двигаться, и он может слышать ваш голос. Его кровеносная и мочевыделительная системы полностью функционируют.';

  @override
  String get week16Mom =>
      'Вы можете почувствовать первые легкие движения, называемые \'шевелениями\'. Это может ощущаться как пузырьки газа или нежное щекотание.';

  @override
  String get week17Dev =>
      'Под кожей ребенка начинают образовываться жировые запасы, которые помогут регулировать температуру его тела после рождения. Малыш размером с луковицу.';

  @override
  String get week17Mom =>
      'Ваш аппетит может увеличиться. Следите за выбором здоровой пищи, чтобы поддержать растущего малыша.';

  @override
  String get week18Dev =>
      'Нервная система быстро созревает. Вокруг нервов образуется защитная оболочка, называемая миелином.';

  @override
  String get week18Mom =>
      'Вам может быть трудно спать комфортно. Попробуйте спать на боку с подушками для поддержки. Вы также можете иногда чувствовать головокружение.';

  @override
  String get week19Dev =>
      'На коже ребенка образуется воскообразное защитное покрытие, называемое первородной смазкой, чтобы защитить ее от амниотической жидкости.';

  @override
  String get week19Mom =>
      'Ваша кожа может меняться. У некоторых женщин появляются темные пятна, называемые мелазмой, или темная линия на животе, называемая linea nigra.';

  @override
  String get week20Dev =>
      'Половина пути пройдена! Вероятно, вы теперь более отчетливо чувствуете движения вашего малыша. Он больше глотает, что является хорошей практикой для его пищеварительной системы.';

  @override
  String get week20Mom =>
      'Обычно в это время назначается УЗИ для оценки анатомии. Ваш пупок может выпятиться.';

  @override
  String get week21Dev =>
      'Брови и веки ребенка теперь присутствуют. Его удары и толчки становятся все сильнее и чаще.';

  @override
  String get week21Mom =>
      'Судороги в ногах, особенно ночью, могут стать обычным явлением. Убедитесь, что вы пьете достаточно воды и делаете растяжку.';

  @override
  String get week22Dev =>
      'Ребенок теперь выглядит как миниатюрный новорожденный. Его губы, зачатки зубов и глаза более развиты. Он размером с папайю.';

  @override
  String get week22Mom =>
      'Ваши ноги могут отекать. Поднятие ног вверх может помочь. Растяжки могут начать появляться на животе, груди или бедрах.';

  @override
  String get week23Dev =>
      'Слух улучшается. Ребенок может слышать звуки из внешнего мира, такие как ваш голос или музыка, более четко.';

  @override
  String get week23Mom =>
      'Вы можете испытывать схватки Брэкстона-Хикса, которые являются \'тренировочными\' схватками, ощущаемыми как напряжение живота.';

  @override
  String get week24Dev =>
      'Легкие ребенка развивают ветви дыхательного \'дерева\', а также клетки, производящие сурфактант — вещество, которое поможет ему дышать при рождении.';

  @override
  String get week24Mom =>
      'Ваш врач, скорее всего, проверит вас на гестационный диабет между этой и 28 неделями. Ваша кожа может чесаться по мере растяжения.';

  @override
  String get week25Dev =>
      'Ребенок практикуется в дыхании, вдыхая и выдыхая амниотическую жидкость. Его волосы растут и могут иметь цвет и текстуру.';

  @override
  String get week25Mom =>
      'Боли в спине очень распространены, так как ваш центр тяжести смещается, а растущий живот создает нагрузку на мышцы спины.';

  @override
  String get week26Dev =>
      'Глаза ребенка начинают открываться и могут обнаруживать свет. Его циклы сна и бодрствования становятся более устоявшимися.';

  @override
  String get week26Mom =>
      'Вы можете обнаружить, что стали более забывчивой, что часто называют \'беременным мозгом\'. Это нормально и временно!';

  @override
  String get week27Dev =>
      'Мозг ребенка сейчас очень активен. Его легкие все еще созревают, но могли бы функционировать с медицинской помощью, если бы он родился сейчас.';

  @override
  String get week27Mom =>
      'Добро пожаловать в третий триместр! Вы можете снова почувствовать себя более уставшей по мере роста ребенка. Изжога — частая жалоба.';

  @override
  String get week28Dev =>
      'Ребенок быстро набирает вес, накапливая слои жира. Он может моргать глазами, на которых теперь есть ресницы.';

  @override
  String get week28Mom =>
      'Визиты к врачу, скорее всего, станут чаще. Синдром беспокойных ног может стать проблемой для некоторых женщин ночью.';

  @override
  String get week29Dev =>
      'Кости ребенка полностью развиты, но все еще мягкие и податливые. Его удары сильные и видны снаружи.';

  @override
  String get week29Mom =>
      'Запоры и геморрой могут стать проблемой из-за гормонов и давления матки. Увеличьте потребление клетчатки и воды.';

  @override
  String get week30Dev =>
      'Ребенок теперь может самостоятельно регулировать температуру своего тела. Его голова растет, чтобы освободить место для развивающегося мозга. Малыш размером с большую капусту.';

  @override
  String get week30Mom =>
      'Вы можете чувствовать одышку, так как матка давит на диафрагму. Ваш сон может часто прерываться.';

  @override
  String get week31Dev =>
      'Ребенок практикует все пять чувств. Он обрабатывает информацию, отслеживает свет и пробует на вкус то, что вы едите, через амниотическую жидкость.';

  @override
  String get week31Mom =>
      'Вы можете заметить желтоватую жидкость, молозиво, вытекающую из вашей груди. Это первое молоко для вашего малыша.';

  @override
  String get week32Dev =>
      'Ребенок, вероятно, занял положение головой вниз в подготовке к родам. Ногти на ногах закончили расти.';

  @override
  String get week32Mom =>
      'Схватки Брэкстона-Хикса могут становиться сильнее и чаще. Вы на финишной прямой!';

  @override
  String get week33Dev =>
      'Череп ребенка все еще мягкий, что позволяет ему легче проходить через родовой канал. Его иммунная система получает от вас поддержку.';

  @override
  String get week33Mom =>
      'Может быть трудно найти удобное положение для чего-либо — сидения, стояния или сна. Давление на мочевой пузырь интенсивное.';

  @override
  String get week34Dev =>
      'Центральная нервная система ребенка созревает, а легкие хорошо развиты. Защитное покрытие из первородной смазки на его коже становится толще.';

  @override
  String get week34Mom =>
      'Ваше зрение может быть немного нечетким из-за задержки жидкости. Это должно пройти после родов.';

  @override
  String get week35Dev =>
      'Ребенку уже не так много места для движений, поэтому они могут ощущаться скорее как перекатывания и извивания, чем резкие удары.';

  @override
  String get week35Mom =>
      'Вероятно, на этой неделе у вас возьмут анализ на стрептококк группы B. Ваш врач будет следить за признаками начала родов.';

  @override
  String get week36Dev =>
      'Ребенок считается \'ранним доношенным\'. Он сбрасывает большую часть тонких волос (лануго) и воскообразного покрытия (первородной смазки), которые покрывали его кожу.';

  @override
  String get week36Mom =>
      'Вы можете почувствовать, как ребенок \'опускается\' в таз. Это может облегчить давление на легкие, но увеличить его на мочевой пузырь.';

  @override
  String get week37Dev =>
      'Ребенок теперь считается \'доношенным\'! Он практикует дыхательные движения, и его хватка крепкая.';

  @override
  String get week37Mom =>
      'Вы можете чувствовать смесь волнения, беспокойства и нетерпения. Следите за признаками родов, такими как регулярные схватки или отхождение вод.';

  @override
  String get week38Dev =>
      'У ребенка полная голова волос, а его мозг и легкие будут продолжать созревать до рождения. Он набирает около 200 граммов в неделю.';

  @override
  String get week38Mom =>
      'У вас может быть много влагалищных выделений и отойти слизистая пробка. Ваше тело готовится к большому дню!';

  @override
  String get week39Dev =>
      'Ребенок готов встретиться с вами! Его мозг все еще развивается невероятными темпами. Он пухлый и готов к жизни вне матки.';

  @override
  String get week39Mom =>
      'Старайтесь отдыхать как можно больше. Теперь это игра в ожидание! Прогулки и легкая активность могут помочь стимулировать начало родов.';

  @override
  String get week40Dev =>
      'С предполагаемой датой родов! Помните, что только около 5% детей рождаются в свой срок. Ваш малыш полностью созрел и ждет сигнала к рождению.';

  @override
  String get week40Mom =>
      'Вы можете чувствовать большое давление в области таза и дискомфорт. Позвоните врачу, если думаете, что у вас начались роды, или если отошли воды.';

  @override
  String get week41Dev =>
      'Ребенок теперь \'поздний доношенный\'. Он продолжает расти, и его ногти и волосы могут быть довольно длинными при рождении.';

  @override
  String get week41Mom =>
      'Ваш врач может обсудить варианты стимуляции родов. Вас будут тщательно наблюдать, чтобы убедиться, что с ребенком все в порядке.';

  @override
  String get week42Dev =>
      'Ребенок \'переношенный\'. Риски немного выше, поэтому стимуляция очень вероятна, если роды не начались естественным образом.';

  @override
  String get week42Mom =>
      'Может быть эмоционально тяжело перехаживать срок. Доверяйте своему телу и своей медицинской команде. Вы очень скоро встретитесь со своим малышом!';

  @override
  String get settingsUserFallbackName => 'Пользователь Bloom Mama';

  @override
  String get settingsUserFallbackEmail => 'Нет связанной почты';

  @override
  String get settingsAffirmationsEnabled => 'Ежедневные аффирмации включены!';

  @override
  String get settingsAffirmationsDisabled => 'Ежедневные аффирмации выключены.';

  @override
  String get symptomHistoryErrorLoad => 'Не удалось загрузить историю.';

  @override
  String get symptonHistoryErrorEmpty => 'История симптомов не найдена.';

  @override
  String get symptomHistoryTooltip => 'Просмотр истории';

  @override
  String get symptomErrorLoad => 'Не удалось загрузить сегодняшние симптомы.';

  @override
  String get symptomSuccessSave => 'Симптомы за сегодня сохранены!';

  @override
  String symptomErrorSave(String error) {
    return 'Не удалось сохранить симптомы: $error';
  }

  @override
  String get symptomDialogWhatToDo => 'Что можно сделать:';

  @override
  String get symptomDialogCheckbox => 'Я испытываю это';

  @override
  String get symptomDialogClose => 'Закрыть';

  @override
  String get symptomNauseaDef =>
      'Чувство тошноты с позывом к рвоте, часто называемое \'утренней тошнотой\', но может возникать в любое время.';

  @override
  String get symptomNauseaAdv =>
      'Попробуйте есть маленькими, частыми порциями. Имбирный чай или леденцы могут помочь. Пейте достаточно воды.';

  @override
  String get symptomFatigueDef =>
      'Подавляющее чувство усталости и нехватки энергии.';

  @override
  String get symptomFatigueAdv =>
      'Прислушивайтесь к своему телу и отдыхайте, когда можете. Легкие упражнения, такие как ходьба, могут повысить энергию.';

  @override
  String get symptomHeadacheDef =>
      'Боль или дискомфорт в голове, часто вызванные гормональными сдвигами или обезвоживанием.';

  @override
  String get symptomHeadacheAdv =>
      'Отдыхайте в тихой, темной комнате. Приложите прохладный компресс. Проконсультируйтесь с врачом перед приемом любых лекарств.';

  @override
  String get symptomHeartburnDef =>
      'Ощущение жжения в груди, вызванное забросом желудочной кислоты в пищевод.';

  @override
  String get symptomHeartburnAdv =>
      'Ешьте меньшими порциями. Избегайте острой, жирной или кислой пищи. Не ложитесь сразу после еды.';

  @override
  String get symptomConstipationDef =>
      'Трудности с опорожнением кишечника, вызванные замедлением пищеварения из-за гормонов.';

  @override
  String get symptomConstipationAdv =>
      'Увеличьте потребление клетчатки: ешьте больше фруктов, овощей и цельнозерновых. Пейте много воды и будьте активны.';

  @override
  String get symptomBackPainDef =>
      'Боли в нижней части спины из-за увеличения веса и смещения центра тяжести.';

  @override
  String get symptomBackPainAdv =>
      'Следите за осанкой. Используйте поддерживающий стул. Теплая ванна или пренатальный массаж могут принести облегчение.';

  @override
  String get symptomSwellingDef =>
      'Небольшие отеки (эдема) на лодыжках, ступнях и руках, вызванные задержкой жидкости.';

  @override
  String get symptomSwellingAdv =>
      'Поднимайте ноги как можно чаще. Избегайте длительного стояния. Носите удобную обувь.';

  @override
  String get symptomCrampsDef =>
      'Легкие, похожие на менструальные, спазмы внизу живота, часто из-за расширения матки.';

  @override
  String get symptomCrampsAdv =>
      'Смените положение, отдохните или примите теплую ванну. Если спазмы сильные, немедленно свяжитесь с врачом.';

  @override
  String get symptomSkinChangesDef =>
      'Изменения, такие как акне, темные пятна (мелазма) или \'черная линия\' на животе.';

  @override
  String get symptomSkinChangesAdv =>
      'Используйте мягкие средства для ухода за кожей. Всегда используйте солнцезащитный крем, так как ваша кожа более чувствительна.';

  @override
  String get symptomCravingsDef =>
      'Сильное, внезапное желание съесть определенный вид пищи.';

  @override
  String get symptomCravingsAdv =>
      'Можно позволять себе небольшие слабости в умеренных количествах, но старайтесь находить более здоровые альтернативы.';

  @override
  String get symptomMoodSwingsDef =>
      'Быстро меняющиеся эмоции, от радости до грусти или раздражительности, из-за гормональных колебаний.';

  @override
  String get symptomMoodSwingsAdv =>
      'Высыпайтесь, хорошо питайтесь и занимайтесь спортом. Говорите о своих чувствах с партнером или другом.';

  @override
  String get symptomAnxietyDef =>
      'Чувства беспокойства, нервозности или тревоги по поводу беременности, родов или родительства.';

  @override
  String get symptomAnxietyAdv =>
      'Практикуйте осознанность или пренатальную медитацию. Присоединитесь к группе поддержки. Обсудите свои страхи с врачом.';

  @override
  String get symptomNausea => 'Тошнота';

  @override
  String get symptomFatigue => 'Усталость';

  @override
  String get symptomHeadache => 'Головная боль';

  @override
  String get symptomHeartburn => 'Изжога';

  @override
  String get symptomConstipation => 'Запор';

  @override
  String get symptomBackPain => 'Боль в спине';

  @override
  String get symptomSwelling => 'Отеки';

  @override
  String get symptomCramps => 'Спазмы';

  @override
  String get symptomSkinChanges => 'Изменения кожи';

  @override
  String get symptomCravings => 'Тяга к еде';

  @override
  String get symptomMoodSwings => 'Перепады настроения';

  @override
  String get symptomAnxiety => 'Тревожность';

  @override
  String get uncommonSymptomDetailTitle => 'Детали симптома';

  @override
  String get uncommonSymptomIsItNormal => 'Это нормально?';

  @override
  String get uncommonSymptom1Title => 'Металлический привкус во рту?';

  @override
  String get uncommonSymptom1Desc =>
      'Некоторые женщины сообщают о кислом или металлическом привкусе во рту в первом триместре, даже когда не едят. Это известно как дисгевзия.';

  @override
  String get uncommonSymptom1Normal =>
      'Да, это на удивление нормально! Считается, что это вызвано всплеском гормонов беременности, особенно эстрогена. Обычно это проходит ко второму триместру. Чистка языка, жевание жвачки без сахара или полоскание рта слабым солевым раствором могут помочь.';

  @override
  String get uncommonSymptom2Title => 'Внезапно начала храпеть?';

  @override
  String get uncommonSymptom2Desc =>
      'Даже если вы никогда раньше не храпели, вы можете начать во время беременности. Часто это связано с усилением кровотока, вызывающим отек слизистых оболочек носа.';

  @override
  String get uncommonSymptom2Normal =>
      'Да, это нормально (хотя, возможно, раздражает вашего партнера!). Попробуйте спать на боку и использовать увлажнитель воздуха в комнате. Если храп сильный или вы задыхаетесь, сообщите об этом врачу, чтобы исключить апноэ во сне.';

  @override
  String get uncommonSymptom3Title => 'Темная линия на животе?';

  @override
  String get uncommonSymptom3Desc =>
      'Темная вертикальная линия, называемая \'linea nigra\', может появиться на вашем животе, идущая от пупка до лобковой кости.';

  @override
  String get uncommonSymptom3Normal =>
      'Совершенно нормально. Это вызвано гормонами беременности, которые увеличивают выработку меланина в коже. Это чаще встречается у женщин с более темным цветом кожи и исчезнет само по себе через несколько месяцев после родов.';

  @override
  String get uncommonSymptom4Title => 'Кровоточат десны?';

  @override
  String get uncommonSymptom4Desc =>
      'Вы можете заметить, что ваши десны опухли, стали чувствительными или легко кровоточат при чистке зубов щеткой или нитью.';

  @override
  String get uncommonSymptom4Normal =>
      'Да, это очень распространено и называется \'гингивит беременных\'. Гормональные изменения делают ваши десны более восприимчивыми к зубному налету и воспалению. Соблюдайте отличную гигиену полости рта и посетите стоматолога для осмотра. Обычно это проходит после родов.';

  @override
  String get uncommonSymptom5Title => 'Мои ноги выросли на размер?';

  @override
  String get uncommonSymptom5Desc =>
      'Может показаться, что ваша обувь внезапно стала слишком тесной, а ноги выглядят более плоскими и длинными.';

  @override
  String get uncommonSymptom5Normal =>
      'Да, такое может случиться! Гормон беременности релаксин ослабляет связки в стопах, из-за чего своды стоп опускаются, а стопы расширяются. Также может быть отек. У некоторых женщин это изменение остается навсегда. Это хороший повод носить удобную, поддерживающую обувь.';

  @override
  String get uncommonSymptom6Title => 'Мое обоняние стало сверхчеловеческим?';

  @override
  String get uncommonSymptom6Desc =>
      'Многие женщины обнаруживают, что их обоняние становится невероятно чувствительным, из-за чего некоторые запахи, даже приятные, внезапно становятся невыносимыми.';

  @override
  String get uncommonSymptom6Normal =>
      'Да, это очень распространено. Известное как \'гиперосмия\', это вызвано гормонами беременности. Часто это один из самых ранних признаков беременности и обычно проходит после первого триместра. Используйте продукты без запаха, если это вас беспокоит.';

  @override
  String get uncommonSymptom7Title => 'Что такое \'прострелы в промежности\'?';

  @override
  String get uncommonSymptom7Desc =>
      'Внезапные, острые, стреляющие боли глубоко в тазу, прямой кишке или влагалище, которые длятся всего несколько секунд.';

  @override
  String get uncommonSymptom7Normal =>
      'Да, и название подходящее! Обычно это вызвано давлением ребенка на нервы в нижней части таза. Хотя это и пугает, в целом это безвредно. Смена положения часто может принести немедленное облегчение.';

  @override
  String get uncommonSymptom8Title => 'Я все забываю?';

  @override
  String get uncommonSymptom8Desc =>
      'Вы можете обнаружить, что входите в комнату и забываете зачем, или с трудом подбираете слова. Это часто называют \'беременным мозгом\'.';

  @override
  String get uncommonSymptom8Normal =>
      'Совершенно нормально! Хотя это не формальное медицинское состояние, гормональные изменения, недостаток сна и стресс беременности могут способствовать этой временной рассеянности. Составляйте списки и будьте добры к себе — ваша память вернется.';

  @override
  String get uncommonSymptom9Title => 'Мой пупок выпятился?';

  @override
  String get uncommonSymptom9Desc =>
      'По мере расширения матки она может выталкивать ваш пупок вперед, превращая \'внутренний\' пупок во \'внешний\'.';

  @override
  String get uncommonSymptom9Normal =>
      'Да, это классический признак растущего живота, обычно происходящий во втором или третьем триместре. Это безвредно, и ваш пупок почти всегда вернется в прежнее состояние после родов.';

  @override
  String get uncommonSymptom10Title => 'Мое зрение кажется нечетким?';

  @override
  String get uncommonSymptom10Desc =>
      'Вы можете заметить, что ваше зрение не такое острое, или ваши контактные линзы стали неудобными.';

  @override
  String get uncommonSymptom10Normal =>
      'Небольшая нечеткость зрения — это нормально. Задержка жидкости может незначительно изменить толщину и форму вашей роговицы. Однако, если вы испытываете значительные изменения, двоение в глазах или вспышки света, немедленно свяжитесь с врачом, так как это может быть признаком преэклампсии.';

  @override
  String get uncommonSymptom11Title => 'Это новые папилломы?';

  @override
  String get uncommonSymptom11Desc =>
      'Маленькие, мягкие новообразования цвета кожи, часто появляющиеся в местах трения кожи, например, под мышками, на шее или под линией бюстгальтера.';

  @override
  String get uncommonSymptom11Normal =>
      'Да, это очень распространено. Они вызваны гормонами и ростом клеток. Они безвредны и часто исчезают после беременности, хотя некоторые могут остаться.';

  @override
  String get uncommonSymptom12Title => 'Почему из груди течет?';

  @override
  String get uncommonSymptom12Desc =>
      'Вы можете заметить желтоватую, липкую жидкость, вытекающую из сосков. Это молозиво, первое молоко вашего ребенка.';

  @override
  String get uncommonSymptom12Normal =>
      'Да, это ваше тело готовится к грудному вскармливанию. Это может начаться уже во втором триместре. Если это доставляет неудобства, вы можете использовать прокладки для груди. Не волнуйтесь, у вас не \'закончится\' молоко до прибытия ребенка!';

  @override
  String get uncommonSymptom13Title => 'Увеличились влагалищные выделения?';

  @override
  String get uncommonSymptom13Desc =>
      'Увеличение жидких, молочно-белых выделений со слабым запахом является обычным явлением на протяжении всей беременности.';

  @override
  String get uncommonSymptom13Normal =>
      'Да, это называется \'лейкорея\' и это совершенно нормально. Это помогает предотвратить попадание инфекций в матку. Если выделения окрашены, имеют сильный запах или сопровождаются зудом или жжением, позвоните врачу.';

  @override
  String get uncommonSymptom14Title => 'Мои волосы стали такими густыми!';

  @override
  String get uncommonSymptom14Desc =>
      'Вы можете заметить, что ваши волосы кажутся более густыми, и вы теряете их меньше, чем обычно.';

  @override
  String get uncommonSymptom14Normal =>
      'Да, наслаждайтесь, пока это длится! Гормоны беременности продлевают фазу роста ваших волосяных фолликулов, что означает, что вы меньше линяете. Имейте в виду, что после родов это изменится, что приведет к периоду заметного (но нормального) послеродового выпадения волос.';

  @override
  String get uncommonSymptom15Title =>
      'Мои ноги не перестают дергаться по ночам?';

  @override
  String get uncommonSymptom15Desc =>
      'Неконтролируемое желание двигать ногами, часто сопровождающееся ощущением \'мурашек\' или дрожи, особенно когда вы пытаетесь отдохнуть.';

  @override
  String get uncommonSymptom15Normal =>
      'Это похоже на Синдром беспокойных ног (СБН), который очень распространен в третьем триместре. Часто это связано с дефицитом железа или фолиевой кислоты. Растяжка перед сном, массаж и достаточное количество железа в рационе могут помочь.';

  @override
  String get settingsLanguage => 'Язык';

  @override
  String get languageEnglish => 'Английский';

  @override
  String get languageRussian => 'Русский';

  @override
  String get languageSpanish => 'Испанский';

  @override
  String get babySizeTinyCells => 'крошечный комочек клеток';

  @override
  String get babySizePoppySeed => 'маковое зёрнышко';

  @override
  String get babySizeAppleSeed => 'яблочное семечко';

  @override
  String get babySizeSweetPea => 'горошина';

  @override
  String get babySizeBlueberry => 'черника';

  @override
  String get babySizeRaspberry => 'малина';

  @override
  String get babySizeCherry => 'вишня';

  @override
  String get babySizeStrawberry => 'клубника';

  @override
  String get babySizeLime => 'лайм';

  @override
  String get babySizePlum => 'слива';

  @override
  String get babySizePeach => 'персик';

  @override
  String get babySizeLemon => 'лимон';

  @override
  String get babySizeApple => 'яблоко';

  @override
  String get babySizeAvocado => 'авокадо';

  @override
  String get babySizePear => 'груша';

  @override
  String get babySizeBellPepper => 'сладкий перец';

  @override
  String get babySizeMango => 'манго';

  @override
  String get babySizeBanana => 'банан';

  @override
  String get babySizeCarrot => 'морковь';

  @override
  String get babySizeSpaghettiSquash => 'спагетти-сквош';

  @override
  String get babySizeGrapefruit => 'грейпфрут';

  @override
  String get babySizeCorn => 'початок кукурузы';

  @override
  String get babySizeCauliflower => 'цветная капуста';

  @override
  String get babySizeLettuce => 'кочан салата';

  @override
  String get babySizeRutabaga => 'брюква';

  @override
  String get babySizeEggplant => 'баклажан';

  @override
  String get babySizeButternutSquash => 'мускатная тыква';

  @override
  String get babySizeCabbage => 'капуста';

  @override
  String get babySizeCoconut => 'кокос';

  @override
  String get babySizeJicama => 'хикама';

  @override
  String get babySizePineapple => 'ананас';

  @override
  String get babySizeCantaloupe => 'дыня-канталупа';

  @override
  String get babySizeHoneydew => 'медовая дыня';

  @override
  String get babySizeRomaine => 'кочан салата ромэн';

  @override
  String get babySizeSwissChard => 'пучок мангольда';

  @override
  String get babySizeLeek => 'лук-порей';

  @override
  String get babySizePumpkin => 'маленькая тыква';

  @override
  String get babySizeWatermelon => 'арбуз';

  @override
  String get babySizeReady => 'готов к встрече с вами!';
}
