Repository: abdukerimovislam/super_mama
Catalog: lib/l10n/app_*.arb
Languages: es, ru

# uncommonSymptom1Normal
source: Yes, this is surprisingly normal! It's believed to be caused by the surge in pregnancy hormones, particularly estrogen. It usually fades by the second trimester. Brushing your tongue, chewing sugar-free gum, or rinsing with a mild saltwater solution can help.
es: ¡Sí, esto es sorprendentemente normal! Se cree que es causado por el aumento de las hormonas del embarazo, particularmente el estrógeno. Generalmente desaparece en el segundo trimestre. Cepillarse la lengua, masticar chicle sin azúcar o enjuagarse con una solución suave de agua salada puede ayudar.
ru: Да, это на удивление нормально! Считается, что это вызвано всплеском гормонов беременности, особенно эстрогена. Обычно это проходит ко второму триместру. Чистка языка, жевание жвачки без сахара или полоскание рта слабым солевым раствором могут помочь.

# uncommonSymptom2Title
source: Suddenly Snoring?
es: ¿Ronquidos repentinos?
ru: Внезапно начала храпеть?

# uncommonSymptom2Desc
source: Even if you've never snored before, you might start during pregnancy. This is often due to increased blood flow causing the mucous membranes in your nose to swell.
es: Incluso si nunca antes has roncado, podrías empezar durante el embarazo. A menudo se debe al aumento del flujo sanguíneo que causa la hinchazón de las membranas mucosas de la nariz.
ru: Даже если вы никогда раньше не храпели, вы можете начать во время беременности. Часто это связано с усилением кровотока, вызывающим отек слизистых оболочек носа.

# uncommonSymptom2Normal
source: Yes, it's normal (though perhaps annoying for your partner!). Try sleeping on your side and using a humidifier in your room. If it's severe or you're gasping for air, mention it to your doctor to rule out sleep apnea.
es: Sí, es normal (¡aunque quizás molesto para tu pareja!). Intenta dormir de lado y usar un humidificador en tu habitación. Si es severo o te quedas sin aliento, menciónalo a tu médico para descartar la apnea del sueño.
ru: Да, это нормально (хотя, возможно, раздражает вашего партнера!). Попробуйте спать на боку и использовать увлажнитель воздуха в комнате. Если храп сильный или вы задыхаетесь, сообщите об этом врачу, чтобы исключить апноэ во сне.

# uncommonSymptom3Title
source: Dark Line on My Belly?
es: ¿Línea oscura en mi vientre?
ru: Темная линия на животе?

# uncommonSymptom3Desc
source: A dark, vertical line, called the 'linea nigra,' may appear on your abdomen, running from your navel to your pubic bone.
es: Una línea oscura y vertical, llamada 'línea nigra', puede aparecer en tu abdomen, desde el ombligo hasta el hueso púbico.
ru: Темная вертикальная линия, называемая 'linea nigra', может появиться на вашем животе, идущая от пупка до лобковой кости.

# uncommonSymptom3Normal
source: Perfectly normal. This is caused by pregnancy hormones that increase melanin production in your skin. It's more common in women with darker complexions and will fade on its own a few months after delivery.
es: Perfectamente normal. Es causada por las hormonas del embarazo que aumentan la producción de melanina en la piel. Es más común en mujeres de tez más oscura y desaparecerá por sí sola unos meses después del parto.
ru: Совершенно нормально. Это вызвано гормонами беременности, которые увеличивают выработку меланина в коже. Это чаще встречается у женщин с более темным цветом кожи и исчезнет само по себе через несколько месяцев после родов.

# uncommonSymptom4Title
source: My Gums Are Bleeding?
es: ¿Mis encías sangran?
ru: Кровоточат десны?

# uncommonSymptom4Desc
source: You might notice that your gums are swollen, sensitive, or bleed easily when you brush or floss.
es: Podrías notar que tus encías están hinchadas, sensibles o sangran fácilmente al cepillarte los dientes o usar hilo dental.
ru: Вы можете заметить, что ваши десны опухли, стали чувствительными или легко кровоточат при чистке зубов щеткой или нитью.

# uncommonSymptom4Normal
source: Yes, this is very common and is called 'pregnancy gingivitis.' Hormonal changes make your gums more susceptible to plaque and inflammation. Maintain excellent oral hygiene and see your dentist for a checkup. It usually resolves after birth.
es: Sí, esto es muy común y se llama 'gingivitis del embarazo'. Los cambios hormonales hacen que tus encías sean más susceptibles a la placa y la inflamación. Mantén una excelente higiene bucal y visita a tu dentista para un chequeo. Generalmente se resuelve después del nacimiento.
ru: Да, это очень распространено и называется 'гингивит беременных'. Гормональные изменения делают ваши десны более восприимчивыми к зубному налету и воспалению. Соблюдайте отличную гигиену полости рта и посетите стоматолога для осмотра. Обычно это проходит после родов.

# uncommonSymptom5Title
source: My Feet Grew a Size?
es: ¿Mis pies crecieron una talla?
ru: Мои ноги выросли на размер?

# uncommonSymptom5Desc
source: It might feel like your shoes are suddenly too tight, and your feet look flatter and longer.
es: Puede que sientas que tus zapatos de repente te quedan apretados, y tus pies se ven más planos y largos.
ru: Может показаться, что ваша обувь внезапно стала слишком тесной, а ноги выглядят более плоскими и длинными.

# uncommonSymptom5Normal
source: Yes, this can happen! The pregnancy hormone relaxin loosens the ligaments in your feet, causing your arches to fall and your feet to spread. There can also be swelling. For some women, this change is permanent. It's a good reason to wear comfortable, supportive shoes.
es: ¡Sí, puede suceder! La hormona del embarazo relaxina afloja los ligamentos de tus pies, haciendo que los arcos caigan y los pies se ensanchen. También puede haber hinchazón. Para algunas mujeres, este cambio es permanente. Es una buena razón para usar zapatos cómodos y con buen soporte.
ru: Да, такое может случиться! Гормон беременности релаксин ослабляет связки в стопах, из-за чего своды стоп опускаются, а стопы расширяются. Также может быть отек. У некоторых женщин это изменение остается навсегда. Это хороший повод носить удобную, поддерживающую обувь.

# uncommonSymptom6Title
source: My Sense of Smell is Superhuman?
es: ¿Mi sentido del olfato es sobrehumano?
ru: Мое обоняние стало сверхчеловеческим?

# uncommonSymptom6Desc
source: Many women find their sense of smell becomes incredibly sensitive, making certain odors, even pleasant ones, suddenly overwhelming.
es: Muchas mujeres encuentran que su sentido del olfato se vuelve increíblemente sensible, haciendo que ciertos olores, incluso los agradables, sean de repente abrumadores.
ru: Многие женщины обнаруживают, что их обоняние становится невероятно чувствительным, из-за чего некоторые запахи, даже приятные, внезапно становятся невыносимыми.

# uncommonSymptom6Normal
source: Yes, this is very common. Known as 'hyperosmia,' it's caused by pregnancy hormones. It's often one of the earliest signs of pregnancy and usually subsides after the first trimester. Stick to unscented products if it bothers you.
es: Sí, es muy común. Conocido como 'hiperosmia', es causado por las hormonas del embarazo. A menudo es una de las primeras señales de embarazo y generalmente disminuye después del primer trimestre. Usa productos sin perfume si te molesta.
ru: Да, это очень распространено. Известное как 'гиперосмия', это вызвано гормонами беременности. Часто это один из самых ранних признаков беременности и обычно проходит после первого триместра. Используйте продукты без запаха, если это вас беспокоит.

# uncommonSymptom7Title
source: What is 'Lightning Crotch'?
es: ¿Qué es el 'dolor del rayo'?
ru: Что такое 'прострелы в промежности'?

# uncommonSymptom7Desc
source: Sudden, sharp, shooting pains deep in the pelvis, rectum, or vagina that last only a few seconds.
es: Dolores agudos y punzantes en la pelvis profunda, el recto o la vagina que duran solo unos segundos.
ru: Внезапные, острые, стреляющие боли глубоко в тазу, прямой кишке или влагалище, которые длятся всего несколько секунд.

# uncommonSymptom7Normal
source: Yes, and it's aptly named! This is usually caused by the baby's pressure on nerves in your lower pelvis. While startling, it's generally harmless. Changing positions can often provide immediate relief.
es: ¡Sí, y su nombre es muy apropiado! Generalmente es causado por la presión del bebé sobre los nervios en la parte baja de la pelvis. Aunque es alarmante, generalmente es inofensivo. Cambiar de posición a menudo puede proporcionar un alivio inmediato.
ru: Да, и название подходящее! Обычно это вызвано давлением ребенка на нервы в нижней части таза. Хотя это и пугает, в целом это безвредно. Смена положения часто может принести немедленное облегчение.

# uncommonSymptom8Title
source: Am I Forgetting Everything?
es: ¿Estoy olvidando todo?
ru: Я все забываю?

# uncommonSymptom8Desc
source: You might find yourself walking into a room and forgetting why, or struggling to find the right word. This is often called 'pregnancy brain.'
es: Puede que entres a una habitación y olvides por qué, o que te cueste encontrar la palabra correcta. Esto se llama a menudo 'cerebro de embarazada'.
ru: Вы можете обнаружить, что входите в комнату и забываете зачем, или с трудом подбираете слова. Это часто называют 'беременным мозгом'.

# uncommonSymptom8Normal
source: Completely normal! While not a formal medical condition, hormonal changes, lack of sleep, and the stress of pregnancy can contribute to this temporary fogginess. Make lists and be kind to yourself—your memory will return.
es: ¡Completamente normal! Aunque no es una condición médica formal, los cambios hormonales, la falta de sueño y el estrés del embarazo pueden contribuir a esta confusión temporal. Haz listas y sé amable contigo misma, tu memoria volverá.
ru: Совершенно нормально! Хотя это не формальное медицинское состояние, гормональные изменения, недостаток сна и стресс беременности могут способствовать этой временной рассеянности. Составляйте списки и будьте добры к себе — ваша память вернется.

# uncommonSymptom9Title
source: My Belly Button Popped Out?
es: ¿Mi ombligo se salió?
ru: Мой пупок выпятился?

# uncommonSymptom9Desc
source: As your uterus expands, it can push your navel forward, causing an 'innie' to become an 'outie.'
es: A medida que tu útero se expande, puede empujar tu ombligo hacia adelante, haciendo que un ombligo 'hacia adentro' se convierta en 'hacia afuera'.
ru: По мере расширения матки она может выталкивать ваш пупок вперед, превращая 'внутренний' пупок во 'внешний'.

# uncommonSymptom9Normal
source: Yes, this is a classic sign of a growing belly, usually happening in the second or third trimester. It's harmless and your belly button will almost always return to its former state after you give birth.
es: Sí, es una señal clásica de un vientre en crecimiento, que generalmente ocurre en el segundo o tercer trimestre. Es inofensivo y tu ombligo casi siempre volverá a su estado anterior después de dar a luz.
ru: Да, это классический признак растущего живота, обычно происходящий во втором или третьем триместре. Это безвредно, и ваш пупок почти всегда вернется в прежнее состояние после родов.

# uncommonSymptom10Title
source: My Vision Seems Blurry?
es: ¿Mi visión parece borrosa?
ru: Мое зрение кажется нечетким?

# uncommonSymptom10Desc
source: You may notice your vision isn't as sharp, or your contact lenses feel uncomfortable.
es: Puedes notar que tu visión no es tan nítida, o que tus lentes de contacto se sienten incómodos.
ru: Вы можете заметить, что ваше зрение не такое острое, или ваши контактные линзы стали неудобными.

# uncommonSymptom10Normal
source: Mild blurriness is normal. Fluid retention can slightly change the thickness and shape of your cornea. However, if you experience significant changes, double vision, or flashing lights, contact your doctor immediately as it can be a sign of preeclampsia.
es: Una leve borrosidad es normal. La retención de líquidos puede cambiar ligeramente el grosor y la forma de tu córnea. Sin embargo, si experimentas cambios significativos, visión doble o destellos de luz, contacta a tu médico de inmediato, ya que puede ser un signo de preeclampsia.
ru: Небольшая нечеткость зрения — это нормально. Задержка жидкости может незначительно изменить толщину и форму вашей роговицы. Однако, если вы испытываете значительные изменения, двоение в глазах или вспышки света, немедленно свяжитесь с врачом, так как это может быть признаком преэклампсии.

# uncommonSymptom11Title
source: Are These New Skin Tags?
es: ¿Son estas nuevas etiquetas de piel?
ru: Это новые папилломы?

# uncommonSymptom11Desc
source: Small, soft, skin-colored growths, often appearing in areas where skin rubs together, like under your arms, neck, or bra line.
es: Pequeños crecimientos suaves del color de la piel, que a menudo aparecen en áreas donde la piel se roza, como debajo de los brazos, el cuello o la línea del sostén.
ru: Маленькие, мягкие новообразования цвета кожи, часто появляющиеся в местах трения кожи, например, под мышками, на шее или под линией бюстгальтера.

# uncommonSymptom11Normal
source: Yes, it's very common. These are caused by hormones and cell growth. They are harmless and often disappear after pregnancy, though some may remain.
es: Sí, es muy común. Son causados por las hormonas y el crecimiento celular. Son inofensivos y a menudo desaparecen después del embarazo, aunque algunos pueden permanecer.
ru: Да, это очень распространено. Они вызваны гормонами и ростом клеток. Они безвредны и часто исчезают после беременности, хотя некоторые могут остаться.

# uncommonSymptom12Title
source: Why Are My Breasts Leaking?
es: ¿Por qué gotean mis senos?
ru: Почему из груди течет?

# uncommonSymptom12Desc
source: You might notice a yellowish, sticky fluid leaking from your nipples. This is colostrum, your baby's first milk.
es: Podrías notar un líquido amarillento y pegajoso que sale de tus pezones. Esto es calostro, la primera leche de tu bebé.
ru: Вы можете заметить желтоватую, липкую жидкость, вытекающую из сосков. Это молозиво, первое молоко вашего ребенка.

# uncommonSymptom12Normal
source: Yes, this is your body's way of preparing to breastfeed. It can start as early as the second trimester. If it's bothersome, you can use nursing pads inside your bra. Don't worry, you won't 'run out' before the baby arrives!
es: Sí, es la forma en que tu cuerpo se prepara para amamantar. Puede comenzar tan pronto como en el segundo trimestre. Si es molesto, puedes usar protectores de lactancia en tu sostén. ¡No te preocupes, no se te 'acabará' antes de que llegue el bebé!
ru: Да, это ваше тело готовится к грудному вскармливанию. Это может начаться уже во втором триместре. Если это доставляет неудобства, вы можете использовать прокладки для груди. Не волнуйтесь, у вас не 'закончится' молоко до прибытия ребенка!

# uncommonSymptom13Title
source: Increased Vaginal Discharge?
es: ¿Aumento del flujo vaginal?
ru: Увеличились влагалищные выделения?

# uncommonSymptom13Desc
source: An increase in a thin, milky-white, and mild-smelling discharge is common throughout pregnancy.
es: Un aumento en un flujo delgado, de color blanco lechoso y con un olor suave es común durante todo el embarazo.
ru: Увеличение жидких, молочно-белых выделений со слабым запахом является обычным явлением на протяжении всей беременности.

# uncommonSymptom13Normal
source: Yes, this is called 'leukorrhea' and it's perfectly normal. It helps prevent infections from traveling up into the uterus. If the discharge is colored, has a strong odor, or is accompanied by itching or burning, call your doctor.
es: Sí, esto se llama 'leucorrea' y es perfectamente normal. Ayuda a prevenir que las infecciones suban al útero. Si el flujo tiene color, un olor fuerte o se acompaña de picazón o ardor, llama a tu médico.
ru: Да, это называется 'лейкорея' и это совершенно нормально. Это помогает предотвратить попадание инфекций в матку. Если выделения окрашены, имеют сильный запах или сопровождаются зудом или жжением, позвоните врачу.

# uncommonSymptom14Title
source: My Hair is So Thick!
es: ¡Mi cabello está tan grueso!
ru: Мои волосы стали такими густыми!

# uncommonSymptom14Desc
source: You may notice that your hair feels fuller and you're shedding less than usual.
es: Puedes notar que tu cabello se siente más lleno y que se te cae menos de lo habitual.
ru: Вы можете заметить, что ваши волосы кажутся более густыми, и вы теряете их меньше, чем обычно.

# uncommonSymptom14Normal
source: Yes, enjoy it while it lasts! Pregnancy hormones prolong the growth phase of your hair follicles, meaning you don't shed as much. Be aware that this will reverse after birth, leading to a period of noticeable (but normal) postpartum hair loss.
es: ¡Sí, disfrútalo mientras dure! Las hormonas del embarazo prolongan la fase de crecimiento de tus folículos pilosos, lo que significa que no se te cae tanto. Ten en cuenta que esto se revertirá después del parto, lo que llevará a un período de pérdida de cabello posparto notable (pero normal).
ru: Да, наслаждайтесь, пока это длится! Гормоны беременности продлевают фазу роста ваших волосяных фолликулов, что означает, что вы меньше линяете. Имейте в виду, что после родов это изменится, что приведет к периоду заметного (но нормального) послеродового выпадения волос.

# uncommonSymptom15Title
source: My Legs Won't Stop Twitching at Night?
es: ¿Mis piernas no dejan de moverse por la noche?
ru: Мои ноги не перестают дергаться по ночам?

# uncommonSymptom15Desc
source: An uncontrollable urge to move your legs, often accompanied by a creepy-crawly or jittery sensation, especially when you're trying to rest.
es: Una necesidad incontrolable de mover las piernas, a menudo acompañada de una sensación de hormigueo o nerviosismo, especialmente cuando intentas descansar.
ru: Неконтролируемое желание двигать ногами, часто сопровождающееся ощущением 'мурашек' или дрожи, особенно когда вы пытаетесь отдохнуть.

# uncommonSymptom15Normal
source: This sounds like Restless Leg Syndrome (RLS), which is very common in the third trimester. It's often linked to iron or folate deficiency. Stretching before bed, massage, and ensuring you have enough iron in your diet can help.
es: Esto suena como el Síndrome de las Piernas Inquietas (SPI), que es muy común en el tercer trimestre. A menudo está relacionado con la deficiencia de hierro o folato. Estirar antes de acostarse, los masajes y asegurarse de tener suficiente hierro en la dieta pueden ayudar.
ru: Это похоже на Синдром беспокойных ног (СБН), который очень распространен в третьем триместре. Часто это связано с дефицитом железа или фолиевой кислоты. Растяжка перед сном, массаж и достаточное количество железа в рационе могут помочь.

# settingsLanguage
source: Language
es: Idioma
ru: Язык

# languageEnglish
source: English
es: Inglés
ru: Английский

# languageRussian
source: Russian
es: Ruso
ru: Русский

# languageSpanish
source: Spanish
es: Español
ru: Испанский

# babySizeTinyCells
source: a tiny ball of cells
es: una pequeña bola de células
ru: крошечный комочек клеток

# babySizePoppySeed
source: a poppy seed
es: una semilla de amapola
ru: маковое зёрнышко

# babySizeAppleSeed
source: an apple seed
es: una semilla de manzana
ru: яблочное семечко

# babySizeSweetPea
source: a sweet pea
es: un guisante
ru: горошина

# babySizeBlueberry
source: a blueberry
es: un arándano
ru: черника

# babySizeRaspberry
source: a raspberry
es: una frambuesa
ru: малина

# babySizeCherry
source: a cherry
es: una cereza
ru: вишня

# babySizeStrawberry
source: a strawberry
es: una fresa
ru: клубника

# babySizeLime
source: a lime
es: una lima
ru: лайм

# babySizePlum
source: a plum
es: una ciruela
ru: слива

# babySizePeach
source: a peach
es: un durazno
ru: персик

# babySizeLemon
source: a lemon
es: un limón
ru: лимон

# babySizeApple
source: an apple
es: una manzana
ru: яблоко

# babySizeAvocado
source: an avocado
es: un aguacate
ru: авокадо

# babySizePear
source: a pear
es: una pera
ru: груша

# babySizeBellPepper
source: a bell pepper
es: un pimiento
ru: сладкий перец

# babySizeMango
source: a mango
es: un mango
ru: манго

# babySizeBanana
source: a banana
es: un plátano
ru: банан

# babySizeCarrot
source: a carrot
es: una zanahoria
ru: морковь

# babySizeSpaghettiSquash
source: a spaghetti squash
es: una calabaza espagueti
ru: спагетти-сквош

# babySizeGrapefruit
source: a grapefruit
es: un pomelo
ru: грейпфрут

# babySizeCorn
source: an ear of corn
es: una mazorca de maíz
ru: початок кукурузы

# babySizeCauliflower
source: a cauliflower
es: una coliflor
ru: цветная капуста

# babySizeLettuce
source: a head of lettuce
es: una lechuga
ru: кочан салата

# babySizeRutabaga
source: a rutabaga
es: un nabo sueco
ru: брюква

# babySizeEggplant
source: an eggplant
es: una berenjena
ru: баклажан

# babySizeButternutSquash
source: a butternut squash
es: una calabaza moscada
ru: мускатная тыква

# babySizeCabbage
source: a cabbage
es: un repollo
ru: капуста

# babySizeCoconut
source: a coconut
es: un coco
ru: кокос

# babySizeJicama
source: a jicama
es: una jícama
ru: хикама

# babySizePineapple
source: a pineapple
es: una piña
ru: ананас

# babySizeCantaloupe
source: a cantaloupe
es: un melón cantalupo
ru: дыня-канталупа

# babySizeHoneydew
source: a honeydew melon
es: un melón verde
ru: медовая дыня

# babySizeRomaine
source: a head of romaine
es: una lechuga romana
ru: кочан салата ромэн

# babySizeSwissChard
source: a bunch of swiss chard
es: un manojo de acelgas
ru: пучок мангольда

# babySizeLeek
source: a leek
es: un puerro
ru: лук-порей

# babySizePumpkin
source: a small pumpkin
es: una calabaza pequeña
ru: маленькая тыква

# babySizeWatermelon
source: a watermelon
es: una sandía
ru: арбуз

# babySizeReady
source: ready to meet you!
es: ¡listo para conocerte!
ru: готов к встрече с вами!

# toolsHubTitle
source: Pregnancy Tools
ru: Инструменты для беременности
