Repository: abdukerimovislam/super_mama
Catalog: lib/l10n/app_*.arb
Languages: es, ru

# signInWelcome
source: Welcome to Bloom Mama
es: Bienvenida a Bloom Mama
ru: Добро пожаловать в Bloom Mama

source: Sign in with Google
es: Iniciar sesión con Google
ru: Войти через Google

# navHome
source: Home
es: Inicio
ru: Главная

# navJournal
source: Journal
es: Diario
ru: Дневник

# navSymptoms
source: Symptoms
es: Síntomas
ru: Симптомы

# navNormal
source: Normal?
es: ¿Es normal?
ru: Это норма?

# navChecklist
source: Checklist
es: Listas
ru: Список

# navTimers
source: Timers
es: Contadores
ru: Таймеры

# homeScreenWeek
source: Week
es: Semana
ru: Неделя

# homeScreenBabySizeOf
source: Your baby is the size of
es: Tu bebé es del tamaño de
ru: Ваш малыш размером с

# homeScreenSetLMP
source: Set Last Period Date
es: Fijar fecha de última menstruación
ru: Установить дату последней менструации

# homeScreenGoToMyWeek
source: Go to My Current Week (Week {weekNumber})
es: Ir a mi semana actual (Semana {weekNumber})
ru: К моей текущей неделе (Неделя {weekNumber})

# homeScreenChangeDate
source: Change Date
es: Cambiar fecha
ru: Изменить дату

# dailyDigestTitle
source: ✨ Daily Digest
es: ✨ Resumen del día
ru: ✨ Ежедневная подборка

# dailyDigestTip
source: Tip
es: Consejo
ru: Совет

# dailyDigestAffirmation
source: Affirmation
es: Afirmación
ru: Аффирмация

# settingsTitle
source: Settings
es: Ajustes
ru: Настройки

# settingsDailyAffirmations
source: Daily Affirmations
es: Afirmaciones diarias
ru: Ежедневные аффирмации

# settingsDailyAffirmationsSubtitle
source: Receive a positive message twice a day.
es: Recibe un mensaje positivo dos veces al día.
ru: Получайте позитивное сообщение дважды в день.

# settingsLogOut
source: Log Out
es: Cerrar sesión
ru: Выйти

# settingsLogOutConfirmTitle
source: Confirm Log Out
es: Confirmar cierre de sesión
ru: Подтвердите выход

# settingsLogOutConfirm
source: Are you sure you want to log out?
es: ¿Estás segura de que quieres cerrar sesión?
ru: Вы уверены, что хотите выйти?

# settingsCancel
source: Cancel
es: Cancelar
ru: Отмена

# symptomTrackerTitle
source: Symptom Tracker
es: Seguimiento de síntomas
ru: Трекер симптомов

# symptomTrackerGreeting
source: How are you feeling today?
es: ¿Cómo te sientes hoy?
ru: Как вы себя чувствуете сегодня?

# symptomTrackerSave
source: Save Today's Symptoms
es: Guardar síntomas de hoy
ru: Сохранить симптомы за сегодня

# symptomHistoryTitle
source: Symptom History
es: Historial de síntomas
ru: История симптомов

# symptomCatCommon
source: Common Discomforts
es: Molestias comunes
ru: Частые недомогания

# symptomCatBody
source: Body Changes
es: Cambios corporales
ru: Изменения в теле

# symptomCatMood
source: Mood & Cravings
es: Ánimo y antojos
ru: Настроение и желания

# isItNormalTitle
source: Is It Normal?
es: ¿Es normal?
ru: Это нормально?

# checklistTitle
source: Hospital Bag Checklist
es: Bolsa para el hospital
ru: Сумка в роддом

# checklistItemID
source: ID and Insurance Card
es: Identificación y tarjeta del seguro
ru: Паспорт и страховой полис

# checklistItemBirthPlan
source: Birth Plan (if you have one)
es: Plan de parto (si tienes uno)
ru: План родов (если есть)

# checklistItemPhone
source: Phone and Charger (extra long cord!)
es: Teléfono y cargador (¡con cable extralargo!)
ru: Телефон и зарядное устройство (с длинным проводом!)

# checklistItemRobe
source: Comfortable Robe or Gown
es: Bata o camisón cómodo
ru: Удобный халат или ночная рубашка

# checklistItemSlippers
source: Slippers and Non-skid Socks
es: Pantuflas y calcetines antideslizantes
ru: Тапочки и нескользящие носки

# checklistItemNursingBra
source: Nursing Bra and Pads
es: Sujetador de lactancia y protectores
ru: Бюстгальтер для кормления и прокладки

# checklistItemOutfitMom
source: Going-home Outfit for Mom
es: Ropa para salir del hospital para mamá
ru: Одежда на выписку для мамы

# checklistItemToiletries
source: Lip Balm and Toiletries
es: Bálsamo labial y artículos de aseo
ru: Бальзам для губ и туалетные принадлежности

# checklistItemSnacks
source: Snacks and Drinks
es: Aperitivos y bebidas
ru: Перекусы и напитки

# checklistItemOutfitBaby
source: Going-home Outfit for Baby
es: Ropa para salir del hospital para el bebé
ru: Одежда на выписку для малыша

# checklistItemCarSeat
source: Installed Car Seat
es: Silla de auto instalada
ru: Установленное автокресло

# checklistItemPillow
source: Pillow from Home
es: Almohada de casa
ru: Подушка из дома

# timersHubTitle
source: Timers
es: Contadores
ru: Таймеры

# timersContractionTitle
source: Contraction Timer
es: Contador de contracciones
ru: Таймер схваток

# timersContractionSubtitle
source: Time contractions and track their frequency.
es: Mide las contracciones y sigue su frecuencia.
ru: Засекайте схватки и отслеживайте их частоту.

# timersKickTitle
source: Kick Counter
es: Contador de patadas
ru: Счетчик толчков

# timersKickSubtitle
source: Track your baby's kicks to ensure they are active.
es: Sigue las patadas de tu bebé para asegurar que esté activo.
ru: Отслеживайте толчки вашего малыша, чтобы убедиться в его активности.

# journalTitle
source: Daily Journal
es: Diario personal
ru: Ежедневный дневник

# journalGreeting
source: How are you feeling today?
es: ¿Cómo te sientes hoy?
ru: Как вы себя чувствуете сегодня?

# journalTodaysThoughts
source: Today's thoughts:
es: Pensamientos de hoy:
ru: Мысли за сегодня:

# journalHintText
source: Write about your day, your feelings, or any special moments...
es: Escribe sobre tu día, tus sentimientos o cualquier momento especial...
ru: Напишите о своем дне, чувствах или особенных моментах...

# journalSave
source: Save Entry
es: Guardar entrada
ru: Сохранить запись

# journalHistoryTitle
source: Journal History
es: Historial del diario
ru: История записей

# notificationMorningTitle
source: ☀️ Good Morning, Mama!
es: ☀️ ¡Buenos días, mamá!
ru: ☀️ Доброе утро, Мама!

# notificationEveningTitle
source: 🌙 Good Evening, Mama!
es: 🌙 ¡Buenas noches, mamá!
ru: 🌙 Добрый вечер, Мама!

# tip1
source: Stay hydrated! Aim for 8-10 glasses of water a day to support your body and your growing baby.
es: ¡Mantente hidratada! Intenta beber de 8 a 10 vasos de agua al día para apoyar a tu cuerpo y a tu bebé en crecimiento.
ru: Пейте достаточно воды! Старайтесь выпивать 8-10 стаканов в день, чтобы поддержать свой организм и растущего малыша.

# tip2
source: Even a 15-minute walk can boost your mood and energy. Listen to your body and don't overdo it.
es: Incluso una caminata de 15 minutos puede mejorar tu estado de ánimo y energía. Escucha a tu cuerpo y no te excedas.
ru: Даже 15-минутная прогулка может поднять настроение и энергию. Прислушивайтесь к своему телу и не переусердствуйте.

# tip3
source: Folic acid is crucial for baby's neural tube development. Ensure your prenatal vitamin has at least 400 mcg.
es: El ácido fólico es crucial para el desarrollo del tubo neural del bebé. Asegúrate de que tu vitamina prenatal tenga al menos 400 mcg.
ru: Фолиевая кислота крайне важна для развития нервной трубки малыша. Убедитесь, что ваши пренатальные витамины содержат не менее 400 мкг.

# tip4
source: Morning sickness can strike anytime. Try keeping plain crackers by your bed to eat before getting up.
es: Las náuseas matutinas pueden aparecer en cualquier momento. Intenta tener galletas saladas junto a tu cama para comer antes de levantarte.
ru: Утренняя тошнота может начаться в любое время. Попробуйте держать у кровати простые крекеры, чтобы съесть их перед тем, как встать.

# tip5
source: Your body is working hard. Don't feel guilty about taking a nap if you feel tired.
es: Tu cuerpo está trabajando duro. No te sientas culpable por tomar una siesta si te sientes cansada.
ru: Ваше тело усердно работает. Не чувствуйте вины за то, что вздремнули, если чувствуете усталость.

# tip6
source: Add more fiber to your diet with fruits, veggies, and whole grains to help prevent constipation.
es: Añade más fibra a tu dieta con frutas, verduras y cereales integrales para ayudar a prevenir el estreñimiento.
ru: Добавьте больше клетчатки в свой рацион: фрукты, овощи и цельнозерновые продукты помогут предотвратить запор.

# tip7
source: Talk to your baby! They can start to hear your voice this trimester, and it's a great way to bond.
es: ¡Háblale a tu bebé! Puede empezar a oír tu voz en este trimestre, y es una forma estupenda de crear un vínculo.
ru: Разговаривайте со своим малышом! В этом триместре он начинает слышать ваш голос, и это отличный способ установить связь.

# tip8
source: Start a simple pregnancy journal. Write down your thoughts, feelings, and milestones.
es: Empieza un sencillo diario del embarazo. Anota tus pensamientos, sentimientos e hitos.
ru: Начните вести простой дневник беременности. Записывайте свои мысли, чувства и важные моменты.

# tip9
source: Your skin is more sensitive to the sun now. Remember to wear sunscreen, even on cloudy days.
es: Tu piel está más sensible al sol ahora. Recuerda usar protector solar, incluso en días nublados.
ru: Ваша кожа сейчас более чувствительна к солнцу. Не забывайте использовать солнцезащитный крем даже в пасмурные дни.

# tip10
source: Are you getting enough calcium? Dairy, leafy greens, and fortified foods help build baby's bones.
es: ¿Estás tomando suficiente calcio? Los lácteos, las verduras de hoja verde y los alimentos enriquecidos ayudan a formar los huesos del bebé.
ru: Получаете ли вы достаточно кальция? Молочные продукты, листовая зелень и обогащенные продукты помогают строить кости малыша.

# tip11
source: Practice Kegel exercises daily to strengthen your pelvic floor for delivery and postpartum recovery.
es: Practica los ejercicios de Kegel a diario para fortalecer el suelo pélvico para el parto y la recuperación posparto.
ru: Ежедневно выполняйте упражнения Кегеля для укрепления мышц тазового дна для родов и послеродового восстановления.

# tip12
source: Struggling with heartburn? Try eating smaller, more frequent meals throughout the day.
es: ¿Sufres de acidez? Intenta comer comidas más pequeñas y frecuentes a lo largo del día.
ru: Мучает изжога? Попробуйте есть меньшими порциями, но чаще в течение дня.

# tip13
source: A warm (not hot!) bath can be a wonderful way to soothe sore muscles and relax.
es: Un baño tibio (¡no caliente!) puede ser una forma maravillosa de aliviar los músculos doloridos y relajarse.
ru: Теплая (не горячая!) ванна — прекрасный способ успокоить больные мышцы и расслабиться.

# tip14
source: Start moisturizing your belly, hips, and thighs to help with stretching skin and reduce itchiness.
es: Comienza a hidratar tu vientre, caderas y muslos para ayudar con el estiramiento de la piel y reducir el picor.
ru: Начните увлажнять живот, бедра и грудь, чтобы помочь коже растягиваться и уменьшить зуд.

# tip15
source: Feeling moody? It's the hormones. Be kind to yourself and communicate your feelings to your partner.
es: ¿Cambios de humor? Son las hormonas. Sé amable contigo misma y comunica tus sentimientos a tu pareja.
ru: Перепады настроения? Это гормоны. Будьте добры к себе и делитесь своими чувствами с партнером.

# tip16
source: Make a list of questions to ask your doctor at your next appointment so you don't forget.
es: Haz una lista de preguntas para hacerle a tu médico en tu próxima cita para que no se te olvide nada.
ru: Составьте список вопросов, чтобы задать их врачу на следующем приеме и ничего не забыть.

# tip17
source: Practice deep breathing exercises. It's a powerful tool for managing stress now and pain during labor.
es: Practica ejercicios de respiración profunda. Es una herramienta poderosa para manejar el estrés ahora y el dolor durante el parto.
ru: Практикуйте упражнения на глубокое дыхание. Это мощный инструмент для управления стрессом сейчас и болью во время родов.

# tip18
source: Elevate your feet at the end of the day to help reduce swelling in your ankles.
es: Eleva los pies al final del día para ayudar a reducir la hinchazón en los tobillos.
ru: Поднимайте ноги в конце дня, чтобы уменьшить отечность лодыжек.

# tip19
source: Wear comfortable, supportive shoes. Your center of gravity is shifting!
es: Usa zapatos cómodos y de apoyo. ¡Tu centro de gravedad está cambiando!
ru: Носите удобную, поддерживающую обувь. Ваш центр тяжести смещается!

# tip20
source: Cravings are normal! Indulge in moderation, but focus on a balanced diet overall.
es: ¡Los antojos son normales! Permítetelos con moderación, pero enfócate en una dieta equilibrada en general.
ru: Тяга к определенной еде нормальна! Позволяйте себе небольшие слабости, но в целом придерживайтесь сбалансированной диеты.

# tip21
source: Pack a healthy snack in your bag, like nuts or a granola bar, to avoid getting overly hungry.
es: Lleva un snack saludable en tu bolso, como nueces o una barrita de granola, para evitar tener demasiada hambre.
ru: Носите с собой здоровый перекус, например, орехи или гранолу, чтобы не допускать сильного голода.

# tip22
source: Start a gentle stretching routine in the morning to ease stiffness and improve circulation.
es: Comienza una rutina de estiramientos suaves por la mañana para aliviar la rigidez y mejorar la circulación.
ru: Начните утро с легкой растяжки, чтобы снять скованность и улучшить кровообращение.

# tip23
source: Feeling anxious? It's okay. Share your worries with someone you trust, like your partner or a close friend.
es: ¿Sientes ansiedad? Está bien. Comparte tus preocupaciones con alguien de confianza.
ru: Чувствуете тревогу? Это нормально. Поделитесь своими переживаниями с кем-то, кому доверяете.

# tip24
source: Review your health insurance to understand your maternity coverage and hospital options.
es: Revisa tu seguro de salud para entender tu cobertura de maternidad y las opciones de hospital.
ru: Изучите свою медицинскую страховку, чтобы понимать покрытие по беременности и родам и варианты госпиталей.

# tip25
source: Take a weekly 'bumpie' photo to track your beautiful progress!
es: ¡Tómate una foto semanal de tu barriga para seguir tu hermoso progreso!
ru: Делайте еженедельное фото животика, чтобы отслеживать свой прекрасный прогресс!

# tip26
source: Sleep on your left side to improve blood flow to the placenta and your baby.
es: Duerme sobre tu lado izquierdo para mejorar el flujo sanguíneo hacia la placenta y tu bebé.
ru: Спите на левом боку, чтобы улучшить приток крови к плаценте и вашему ребенку.

# tip27
source: Read a chapter of a pregnancy or parenting book each day to feel more prepared.
es: Lee un capítulo de un libro sobre embarazo o crianza cada día para sentirte más preparada.
ru: Читайте по одной главе книги о беременности или родительстве каждый день, чтобы чувствовать себя более подготовленной.

# tip28
source: If you can't sleep, don't just lie there. Get up, read a book, or listen to calming music until you feel sleepy again.
es: Si no puedes dormir, no te quedes en la cama. Levántate, lee un libro o escucha música relajante.
ru: Если не можете уснуть, не лежите просто так. Встаньте, почитайте книгу или послушайте успокаивающую музыку.

# tip29
source: Involve your partner in the journey. Have them talk to the baby or feel the kicks.
es: Involucra a tu pareja en el viaje. Pídele que le hable a la barriga o que sienta las patadas.
ru: Вовлекайте партнера в процесс. Пусть он разговаривает с животиком или чувствует толчки.

# tip30
source: As you get closer to your due date, finalize your hospital bag. It's better to be prepared early!
es: A medida que se acerca la fecha de parto, prepara la bolsa del hospital. ¡Es mejor estar preparada con antelación!
ru: По мере приближения срока родов, соберите сумку в роддом. Лучше быть готовой заранее!

# affirmation1
source: I am creating a miracle within me.
es: Estoy creando un milagro dentro de mí.
ru: Я создаю чудо внутри себя.

# affirmation2
source: My body is strong and capable.
es: Mi cuerpo es fuerte y capaz.
ru: Мое тело сильное и способное.

# affirmation3
source: I trust my body's wisdom to grow my baby.
es: Confío en la sabiduría de mi cuerpo para hacer crecer a mi bebé.
ru: Я доверяю мудрости своего тела в выращивании моего ребенка.

# affirmation4
source: I am calm, relaxed, and at peace.
es: Estoy tranquila, relajada y en paz.
ru: Я спокойна, расслаблена и нахожусь в мире с собой.

# affirmation5
source: Each day brings me closer to meeting my baby.
es: Cada día me acerca más a conocer a mi bebé.
ru: Каждый день приближает меня к встрече с моим малышом.

# affirmation6
source: I am embracing the changes in my body with love.
es: Acepto los cambios en mi cuerpo con amor.
ru: Я с любовью принимаю изменения в своем теле.

# affirmation7
source: I am a wonderful mother.
es: Soy una madre maravillosa.
ru: Я замечательная мать.

# affirmation8
source: I am creating a safe and loving home for my child.
es: Estoy creando un hogar seguro y amoroso para mi hijo.
ru: Я создаю безопасный и любящий дом для моего ребенка.

# affirmation9
source: I am grateful for this incredible journey.
es: Estoy agradecida por este increíble viaje.
ru: Я благодарна за это невероятное путешествие.

# affirmation10
source: I am strong, confident, and empowered.
es: Soy fuerte, segura y empoderada.
ru: Я сильная, уверенная и полная сил.

# affirmation11
source: I release all fear and welcome love.
es: Libero todo miedo y doy la bienvenida al amor.
ru: Я отпускаю весь страх и приветствую любовь.

# affirmation12
source: My baby feels my peace and joy.
es: Mi bebé siente mi paz y mi alegría.
ru: Мой ребенок чувствует мой покой и радость.

# affirmation13
source: I am nourishing myself and my baby with every choice I make.
es: Me estoy nutriendo a mí misma y a mi bebé con cada elección que hago.
ru: Я питаю себя и своего ребенка каждым своим выбором.

# affirmation14
source: I am beautifully pregnant.
es: Estoy hermosamente embarazada.
ru: Я прекрасна в своей беременности.

# affirmation15
source: I am prepared for a positive birth experience.
es: Estoy preparada para una experiencia de parto positiva.
ru: Я готова к позитивному опыту родов.

# affirmation16
source: I am patient and trust the timing of my journey.
es: Soy paciente y confío en los tiempos de mi viaje.
ru: Я терпелива и доверяю времени своего путешествия.

# affirmation17
source: My body knows exactly what to do.
es: Mi cuerpo sabe exactamente qué hacer.
ru: Мое тело точно знает, что делать.

# affirmation18
source: I am surrounded by love and support.
es: Estoy rodeada de amor y apoyo.
ru: Я окружена любовью и поддержкой.

# affirmation19
source: I am doing a great job, and that is enough.
es: Estoy haciendo un gran trabajo, y eso es suficiente.
ru: Я отлично справляюсь, и этого достаточно.

# affirmation20
source: My strength is greater than any discomfort.
es: Mi fuerza es mayor que cualquier incomodidad.
ru: Моя сила больше любого дискомфорта.

# affirmation21
source: I choose to focus on joy and gratitude today.
es: Hoy elijo enfocarme en la alegría y la gratitud.
ru: Сегодня я выбираю сосредоточиться на радости и благодарности.

# affirmation22
source: I am deeply connected to my baby.
es: Estoy profundamente conectada con mi bebé.
ru: Я глубоко связана со своим ребенком.

# affirmation23
source: Every kick and flutter is a reminder of the life I am creating.
es: Cada patada y movimiento es un recordatorio de la vida que estoy creando.
ru: Каждый толчок и шевеление — это напоминание о жизни, которую я создаю.

# affirmation24
source: I am a source of love and life.
es: Soy una fuente de amor y vida.
ru: Я — источник любви и жизни.

# affirmation25
source: I am exactly where I need to be right now.
es: Estoy exactamente donde necesito estar en este momento.
ru: Я нахожусь именно там, где мне нужно быть прямо сейчас.

# affirmation26
source: I am worthy of a beautiful and healthy pregnancy.
es: Merezco un embarazo hermoso y saludable.
ru: Я достойна прекрасной и здоровой беременности.

# affirmation27
source: I am confident in my ability to give birth.
es: Confío en mi capacidad para dar a luz.
ru: Я уверена в своей способности родить.

# affirmation28
source: My baby and I are healthy, safe, and secure.
es: Mi bebé y yo estamos sanos y seguros.
ru: Мой ребенок и я здоровы и в безопасности.

# affirmation29
source: I am creating life, and it is a masterpiece.
es: Estoy creando vida, y es una obra maestra.
ru: Я создаю жизнь, и это шедевр.

# affirmation30
source: Today, I will honor my body, my mind, and my baby.
es: Hoy, honraré mi cuerpo, mi mente y mi bebé.
ru: Сегодня я буду чтить свое тело, свой разум и своего ребенка.

# kickCounterTitle
source: Kick Counter
es: Contador de patadas
ru: Счетчик толчков

# kickCounterInstructions
source: Tap the button below each time you feel a kick.
es: Toca el botón de abajo cada vez que sientas una patada.
ru: Нажимайте кнопку ниже каждый раз, когда чувствуете толчок.

# kickCounterRecordKick
source: Record Kick
es: Registrar patada
ru: Записать толчок

# kickCounterTime
source: Time: {time}
es: Tiempo: {time}
ru: Время: {time}

# kickCounterKicks
source: {count,plural, =1{kick} other{kicks}}
es: {count,plural, =1{patada} other{patadas}}
ru: {count,plural, =1{толчок} few{толчка} many{толчков} other{толчка}}

# kickCounterGoalReached
source: Goal Reached!
es: ¡Meta alcanzada!
ru: Цель достигнута!

# kickCounterGoalMessage
source: You counted 10 kicks in {time}.
es: Contaste 10 patadas en {time}.
ru: Вы насчитали 10 толчков за {time}.

# notificationChannelName
source: Daily Affirmations
es: Afirmaciones Diarias
ru: Ежедневные аффирмации

# notificationChannelDescription
source: Provides daily positive affirmations for mothers.
es: Proporciona afirmaciones positivas diarias para las madres.
ru: Предоставляет ежедневные позитивные аффирмации для мам.

# journalMoodHappy
source: Happy
es: Feliz
ru: Счастлива

# journalMoodGrateful
source: Grateful
es: Agradecida
ru: Благодарна

# journalMoodTired
source: Tired
es: Cansada
ru: Устала

# journalMoodAnxious
source: Anxious
es: Ansiosa
ru: Тревожно

# journalMoodSad
source: Sad
es: Triste
ru: Грустно

# journalErrorEmpty
source: Please write something or select a mood.
es: Por favor, escribe algo o selecciona un estado de ánimo.
ru: Пожалуйста, напишите что-нибудь или выберите настроение.

# journalSuccessSave
source: Journal entry saved!
es: ¡Entrada del diario guardada!
ru: Запись в дневнике сохранена!

# journalErrorSave
source: Failed to save entry: {error}
es: Error al guardar la entrada: {error}
ru: Не удалось сохранить запись: {error}

# journalHistoryErrorLogin
source: You must be logged in to view history.
es: Debes iniciar sesión para ver el historial.
ru: Вы должны войти в систему, чтобы просмотреть историю.

# journalHistoryErrorEmpty
source: No journal entries yet.
es: Aún no hay entradas en el diario.
ru: Записей в дневнике пока нет.

# journalHistoryMood
source: Mood: {moodName}
es: Estado de ánimo: {moodName}
ru: Настроение: {moodName}

# contractionTimerTitle
source: Contraction Timer
es: Contador de contracciones
ru: Таймер схваток

# contractionTimerResetTooltip
source: Reset
es: Reiniciar
ru: Сбросить

# contractionTimerStart
source: Start Contraction
es: Iniciar contracción
ru: Начать схватку

# contractionTimerStop
source: Stop Contraction
es: Detener contracción
ru: Закончить схватку

# contractionTimerEmptyState
source: Start timing your first contraction.
es: Comienza a medir tu primera contracción.
ru: Начните замерять вашу первую схватку.

# contractionTimerDuration
source: Duration: {duration}
es: Duración: {duration}
ru: Длительность: {duration}

# contractionTimerFrequency
source: Frequency: {frequency}
es: Frecuencia: {frequency}
ru: Частота: {frequency}

# signInError
source: Sign-in failed: {error}
es: Error al iniciar sesión: {error}
ru: Ошибка входа: {error}
